Repository: rawadaridi96/ChefMindAI
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fr, hi, pt

# appTitle
source: ChefMind AI
ar: شيف مايند
hi: शेफमाइंड AI

# navChef
source: Chef
hi: शेफ

# navPantry
source: Pantry
ar: المخزن
es: Despensa
fr: Garde-manger
hi: पेंट्री
pt: Despensa

# navRecipes
source: Recipes
ar: الوصفات
es: Recetas
fr: Recettes
hi: रेसिपी
pt: Receitas

# navCart
source: Cart
ar: السلة
es: Carrito
fr: Panier
hi: कार्ट
pt: Carrinho

# homePrompt
source: What are we cooking?
ar: ماذا سنطبخ اليوم؟
es: ¿Qué cocinamos?
fr: Qu'est-ce qu'on cuisine ?
hi: आज क्या बनाएंगे?
pt: O que vamos cozinhar?

# homeSearchHint
source: e.g. Healthy protein snack...
ar: مثال: وجبة خفيفة غنية بالبروتين...
es: Ej: Snack saludable con proteína...
fr: Ex: Collation protéinée saine...
hi: उदाहरण: स्वस्थ प्रोटीन स्नैक...
pt: Ex: Lanche saudável com proteína...

# homeGenerateButton
source: Generate with AI
ar: اقترح بالذكاء الاصطناعي
es: Generar con IA
fr: Générer avec l'IA
hi: AI से बनाएं
pt: Gerar com IA

# homeDiscoverMode
source: Discover 🌍
ar: اكتشف 🌍
es: Descubrir 🌍
fr: Découvrir 🌍
hi: खोजें 🌍
pt: Descobrir 🌍

# homePantryMode
source: My Pantry 🥬
ar: مخزني 🥬
es: Mi Despensa 🥬
fr: Mon Garde-manger 🥬
hi: मेरी पेंट्री 🥬
pt: Minha Despensa 🥬

# homeEmptyPrompt
source: Tell me what to cook first! 🍳
ar: أخبرني ماذا تريد أن تطبخ أولاً! 🍳
es: ¡Dime qué quieres cocinar primero! 🍳
fr: Dites-moi d'abord quoi cuisiner ! 🍳
hi: पहले बताएं क्या बनाना है! 🍳
pt: Me diga o que quer cozinhar primeiro! 🍳

# homeImportFromLink
source: Import from Link
ar: استيراد من رابط
es: Importar desde enlace
fr: Importer depuis un lien
hi: लिंक से आयात करें
pt: Importar do Link

# homePasteUrl
source: Paste recipe URL here...
ar: الصق رابط الوصفة هنا...
es: Pega la URL de la receta aquí...
fr: Collez l'URL de la recette ici...
hi: रेसिपी URL यहां पेस्ट करें...
pt: Cole a URL da receita aqui...

# homeCancel
source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
hi: रद्द करें
pt: Cancelar

# homeImport
source: Import
ar: استيراد
es: Importar
fr: Importer
hi: आयात करें
pt: Importar

# homeRecentIdeas
source: Recent Ideas
ar: الأفكار الأخيرة
es: Ideas Recientes
fr: Idées Récentes
hi: हाल के विचार
pt: Ideias Recentes

# homeClearAll
source: Clear All
ar: مسح الكل
es: Borrar Todo
fr: Tout Effacer
hi: सब हटाएं
pt: Limpar Tudo

# homeHistoryCleared
source: History cleared
ar: تم مسح السجل
es: Historial borrado
fr: Historique effacé
hi: इतिहास साफ हो गया
pt: Histórico limpo

# homeUndo
source: UNDO
ar: تراجع
es: DESHACER
fr: ANNULER
hi: वापस लाएं
pt: DESFAZER

# homeNoRecentHistory
source: No recent history
ar: لا يوجد سجل حديث
es: Sin historial reciente
fr: Pas d'historique récent
hi: कोई हालिया इतिहास नहीं
pt: Sem histórico recente

# homeSetMood
source: Set Your Mood
ar: اختر مزاجك
es: Establece Tu Estado de Ánimo
fr: Définir Votre Humeur
hi: अपना मूड सेट करें
pt: Defina Seu Humor

# homeMoodDescription
source: Choose how you're feeling to inspire recipe suggestions
ar: اختر شعورك للحصول على اقتراحات وصفات ملهمة
es: Elige cómo te sientes para inspirar sugerencias de recetas
fr: Choisissez votre humeur pour inspirer les suggestions de recettes
hi: रेसिपी सुझावों के लिए अपना मूड चुनें
pt: Escolha como você está se sentindo para inspirar sugestões

# homeChefSkills
source: Chef Skills
ar: مهارات الطبخ
es: Habilidades de Chef
fr: Compétences de Chef
hi: शेफ कौशल
pt: Habilidades de Chef

# pantryTitle
source: My Pantry
ar: مخزني
es: Mi Despensa
fr: Mon Garde-manger
hi: मेरी पेंट्री
pt: Minha Despensa

# pantrySearchHint
source: Search ingredients...
ar: ابحث عن المكونات...
es: Buscar ingredientes...
fr: Rechercher des ingrédients...
hi: सामग्री खोजें...
pt: Buscar ingredientes...

# pantryEmpty
source: Your pantry is empty
ar: مخزنك فارغ
es: Tu despensa está vacía
fr: Votre garde-manger est vide
hi: आपकी पेंट्री खाली है
pt: Sua despensa está vazia

# pantryAddFirst
source: Scan or add your first ingredient!
ar: امسح أو أضف أول مكون!
es: ¡Escanea o añade tu primer ingrediente!
fr: Scannez ou ajoutez votre premier ingrédient !
hi: स्कैन करें या पहली सामग्री जोड़ें!
pt: Escaneie ou adicione seu primeiro ingrediente!

# pantryAddIngredient
source: Add Ingredient
ar: إضافة مكون
es: Añadir Ingrediente
fr: Ajouter un Ingrédient
hi: सामग्री जोड़ें
pt: Adicionar Ingrediente

# pantryEditIngredient
source: Edit Ingredient
ar: تعديل المكون
es: Editar Ingrediente
fr: Modifier l'Ingrédient
hi: सामग्री संपादित करें
pt: Editar Ingrediente

# pantryIngredientName
source: Ingredient name
ar: اسم المكون
es: Nombre del ingrediente
fr: Nom de l'ingrédient
hi: सामग्री का नाम
pt: Nome do ingrediente

# pantryQuantity
source: Quantity
ar: الكمية
es: Cantidad
fr: Quantité
hi: मात्रा
pt: Quantidade

# pantryUnit
source: Unit
ar: الوحدة
es: Unidad
fr: Unité
hi: इकाई
pt: Unidade

# pantryExpiryDate
source: Expiry Date
ar: تاريخ انتهاء الصلاحية
es: Fecha de Caducidad
fr: Date d'Expiration
hi: समाप्ति तिथि
pt: Data de Validade

# pantryCategory
source: Category
ar: الفئة
es: Categoría
fr: Catégorie
hi: श्रेणी
pt: Categoria

# pantryAdd
source: Add
ar: إضافة
es: Añadir
fr: Ajouter
hi: जोड़ें
pt: Adicionar

# pantrySave
source: Save
ar: حفظ
es: Guardar
fr: Enregistrer
hi: सहेजें
pt: Salvar

# pantryDeleteConfirm
source: Delete {name}?
ar: حذف {name}؟
es: ¿Eliminar {name}?
fr: Supprimer {name} ?
hi: {name} हटाएं?
pt: Excluir {name}?

# pantryDeleteMessage
source: This will remove the ingredient from your pantry.
ar: سيتم إزالة المكون من مخزنك.
es: Esto eliminará el ingrediente de tu despensa.
fr: Cela supprimera l'ingrédient de votre garde-manger.
hi: यह सामग्री आपकी पेंट्री से हटा दी जाएगी।
pt: Isso removerá o ingrediente da sua despensa.

# pantryDeleted
source: {name} deleted
ar: تم حذف {name}
es: {name} eliminado
fr: {name} supprimé
hi: {name} हटाया गया
pt: {name} excluído

# recipesCurrentResults
source: Current Results
ar: النتائج الحالية
es: Resultados Actuales
fr: Résultats Actuels
hi: वर्तमान परिणाम
pt: Resultados Atuais

# recipesVault
source: The Vault
ar: الخزنة
es: La Bóveda
fr: Le Coffre
hi: वॉल्ट
pt: O Cofre

# recipesGenerating
source: Generating recipes...
ar: جاري إنشاء الوصفات...
es: Generando recetas...
fr: Génération des recettes...
hi: रेसिपी बना रहे हैं...
pt: Gerando receitas...

# recipesEmpty
source: No recipes yet
ar: لا توجد وصفات بعد
es: Aún no hay recetas
fr: Pas encore de recettes
hi: अभी कोई रेसिपी नहीं
pt: Nenhuma receita ainda

# recipesStartSearching
source: Start by searching for something delicious!
ar: ابدأ بالبحث عن شيء لذيذ!
es: ¡Empieza buscando algo delicioso!
fr: Commencez par chercher quelque chose de délicieux !
hi: कुछ स्वादिष्ट खोजना शुरू करें!
pt: Comece buscando algo delicioso!

# recipesSaved
source: Recipe saved to vault!
ar: تم حفظ الوصفة في الخزنة!
es: ¡Receta guardada en la bóveda!
fr: Recette enregistrée dans le coffre !
hi: रेसिपी वॉल्ट में सहेजी गई!
pt: Receita salva no cofre!

# recipesAlreadySaved
source: Recipe already in vault
ar: الوصفة موجودة بالفعل في الخزنة
es: La receta ya está en la bóveda
fr: Recette déjà dans le coffre
hi: रेसिपी पहले से वॉल्ट में है
pt: Receita já está no cofre

# recipesSaveToVault
source: Save to Vault
ar: حفظ في الخزنة
es: Guardar en la Bóveda
fr: Enregistrer dans le Coffre
hi: वॉल्ट में सहेजें
pt: Salvar no Cofre

# recipesViewDetails
source: View Details
ar: عرض التفاصيل
es: Ver Detalles
fr: Voir les Détails
hi: विवरण देखें
pt: Ver Detalhes

# recipesIngredients
source: Ingredients
ar: المكونات
es: Ingredientes
fr: Ingrédients
hi: सामग्री
pt: Ingredientes

# recipesInstructions
source: Instructions
ar: طريقة التحضير
es: Instrucciones
hi: निर्देश
pt: Instruções

# recipesNutrition
source: Nutrition
ar: القيم الغذائية
es: Nutrición
hi: पोषण
pt: Nutrição

# recipesCalories
source: Calories
ar: السعرات
es: Calorías
hi: कैलोरी
pt: Calorias

# recipesProtein
source: Protein
ar: البروتين
es: Proteína
fr: Protéines
hi: प्रोटीन
pt: Proteína

# recipesCarbs
source: Carbs
ar: الكربوهيدرات
es: Carbohidratos
fr: Glucides
hi: कार्ब्स
pt: Carboidratos

# recipesFat
source: Fat
ar: الدهون
es: Grasa
fr: Lipides
hi: वसा
pt: Gordura

# recipesPrepTime
source: Prep Time
ar: وقت التحضير
es: Tiempo de Preparación
fr: Temps de Préparation
hi: तैयारी का समय
pt: Tempo de Preparo

# recipesCookTime
source: Cook Time
ar: وقت الطهي
es: Tiempo de Cocción
fr: Temps de Cuisson
hi: पकाने का समय
pt: Tempo de Cozimento

# recipesServings
source: Servings
ar: الحصص
es: Porciones
fr: Portions
hi: सर्विंग्स
pt: Porções

# recipesDifficulty
source: Difficulty
ar: مستوى الصعوبة
es: Dificultad
fr: Difficulté
hi: कठिनाई
pt: Dificuldade

# recipesShare
source: Share
ar: مشاركة
es: Compartir
fr: Partager
hi: शेयर करें
pt: Compartilhar

# recipesAddToCart
source: Add to Cart
ar: أضف للسلة
es: Añadir al Carrito
fr: Ajouter au Panier
hi: कार्ट में जोड़ें
pt: Adicionar ao Carrinho

# recipesDelete
source: Delete
ar: حذف
es: Eliminar
fr: Supprimer
hi: हटाएं
pt: Excluir

# recipesDeleteConfirm
source: Delete this recipe?
ar: حذف هذه الوصفة؟
es: ¿Eliminar esta receta?
fr: Supprimer cette recette ?
hi: यह रेसिपी हटाएं?
pt: Excluir esta receita?

# recipesDeleteMessage
source: This will remove the recipe from your vault.
ar: سيتم إزالة الوصفة من خزنتك.
es: Esto eliminará la receta de tu bóveda.
fr: Cela supprimera la recette de votre coffre.
hi: यह रेसिपी आपके वॉल्ट से हटा दी जाएगी।
pt: Isso removerá a receita do seu cofre.

# recipesDeleted
source: Recipe deleted
ar: تم حذف الوصفة
es: Receta eliminada
fr: Recette supprimée
hi: रेसिपी हटाई गई
pt: Receita excluída

# recipesMyRecipes
source: My Recipes
ar: وصفاتي
es: Mis Recetas
fr: Mes Recettes
hi: मेरी रेसिपी
pt: Minhas Receitas

# recipesHouseholdVault
source: Household Vault
ar: خزنة العائلة
es: Bóveda del Hogar
fr: Coffre Familial
hi: परिवार का वॉल्ट
pt: Cofre da Família

# recipesPersonalVault
source: Personal Vault
ar: الخزنة الشخصية
es: Bóveda Personal
fr: Coffre Personnel
hi: व्यक्तिगत वॉल्ट
pt: Cofre Pessoal

# recipesEmptyVault
source: Your vault is empty
ar: خزنتك فارغة
es: Tu bóveda está vacía
fr: Votre coffre est vide
hi: आपका वॉल्ट खाली है
pt: Seu cofre está vazio

# recipesSaveFirst
source: Save a recipe to see it here!
ar: احفظ وصفة لتراها هنا!
es: ¡Guarda una receta para verla aquí!
fr: Enregistrez une recette pour la voir ici !
hi: यहां देखने के लिए एक रेसिपी सहेजें!
pt: Salve uma receita para vê-la aqui!

# recipesChefLimitation
source: Chef's Limitation
ar: حد الشيف
es: Limitación del Chef
fr: Limitation du Chef
hi: शेफ की सीमा
pt: Limitação do Chef

# recipesLimitationReached
source: Recipe limit reached
ar: تم الوصول للحد الأقصى
es: Límite de recetas alcanzado
fr: Limite de recettes atteinte
hi: रेसिपी सीमा पूरी हुई
pt: Limite de receitas atingido

# recipesUpgradeForMore
source: Upgrade for more recipes
ar: قم بالترقية للمزيد
es: Mejora para más recetas
fr: Passez à niveau supérieur pour plus
hi: और के लिए अपग्रेड करें
pt: Atualize para mais receitas

# recipesAvailable
source: Available!
ar: متوفر!
es: ¡Disponible!
fr: Disponible !
hi: उपलब्ध!
pt: Disponível!

# recipesHaveCount
source: {have}/{total} Have
ar: {have}/{total} لديك
es: {have}/{total} Tienes
fr: {have}/{total} Possédés
hi: {have}/{total} उपलब्ध
pt: {have}/{total} Disponíveis

# recipesTapForDetails
source: Tap for details & instructions >
ar: اضغط للتفاصيل والتعليمات >
es: Toca para detalles e instrucciones >
fr: Appuyez pour détails & instructions >
hi: विवरण और निर्देश के लिए टैप करें >
pt: Toque para detalhes e instruções >

# recipesGenerateSomeMagic
source: Generate some magic!
ar: اصنع بعض السحر!
es: ¡Crea algo mágico!
fr: Créez de la magie !
hi: कुछ जादू बनाएं!
pt: Crie algo mágico!

# recipesLinks
source: Links
ar: الروابط
es: Enlaces
fr: Liens
hi: लिंक

# shoppingTitle
source: Shopping List
ar: قائمة التسوق
es: Lista de Compras
fr: Liste de Courses
hi: खरीदारी सूची
pt: Lista de Compras

# shoppingEmpty
source: Your cart is empty
ar: سلتك فارغة
es: Tu carrito está vacío
fr: Votre panier est vide
hi: आपका कार्ट खाली है
pt: Seu carrinho está vazio

# shoppingAddFromRecipes
source: Add ingredients from recipes!
ar: أضف المكونات من الوصفات!
es: ¡Añade ingredientes desde las recetas!
fr: Ajoutez des ingrédients depuis les recettes !
hi: रेसिपी से सामग्री जोड़ें!
pt: Adicione ingredientes das receitas!

# shoppingAddItem
source: Add Item
ar: إضافة عنصر
es: Añadir Artículo
fr: Ajouter un Article
hi: आइटम जोड़ें
pt: Adicionar Item

# shoppingItemName
source: Item name
ar: اسم العنصر
es: Nombre del artículo
fr: Nom de l'article
hi: आइटम का नाम
pt: Nome do item

# shoppingClearCompleted
source: Clear Completed
ar: مسح المكتملة
es: Borrar Completados
fr: Effacer les Terminés
hi: पूर्ण हटाएं
pt: Limpar Concluídos

# shoppingItemsCleared
source: Completed items cleared
ar: تم مسح العناصر المكتملة
es: Artículos completados borrados
fr: Articles terminés effacés
hi: पूर्ण आइटम हटाए गए
pt: Itens concluídos limpos

# shoppingAllItems
source: All Items
ar: جميع العناصر
es: Todos los Artículos
fr: Tous les Articles
hi: सभी आइटम
pt: Todos os Itens

# shoppingCompleted
source: Completed
ar: مكتمل
es: Completado
fr: Terminé
hi: पूर्ण
pt: Concluído

# shoppingPending
source: Pending
ar: قيد الانتظار
es: Pendiente
fr: En Attente
hi: लंबित
pt: Pendente

# shoppingAddToCart
source: Add to Cart
ar: أضف للسلة
es: Añadir al Carrito
fr: Ajouter au Panier
hi: कार्ट में जोड़ें
pt: Adicionar ao Carrinho

# shoppingItemNameLabel
source: Item Name
ar: اسم العنصر
es: Nombre del Artículo
fr: Nom de l'Article
hi: आइटम का नाम
pt: Nome do Item

# shoppingQuantityOpt
source: Quantity (Opt.)
ar: الكمية (اختياري)
es: Cantidad (Opc.)
fr: Quantité (Opt.)
hi: मात्रा (वैकल्पिक)
pt: Quantidade (Opc.)

# shoppingRemoveConfirm
source: Remove {name}?
ar: إزالة {name}؟
es: ¿Eliminar {name}?
fr: Supprimer {name} ?
hi: {name} हटाएं?
pt: Remover {name}?

# shoppingRemoveMessage
source: Are you sure you want to remove {name} from your cart?
ar: هل أنت متأكد من إزالة {name} من سلتك؟
es: ¿Estás seguro de eliminar {name} de tu carrito?
fr: Êtes-vous sûr de vouloir supprimer {name} de votre panier ?
hi: क्या आप {name} को कार्ट से हटाना चाहते हैं?
pt: Tem certeza que deseja remover {name} do carrinho?

# shoppingItemRemoved
source: Item removed from cart
ar: تم إزالة العنصر من السلة
es: Artículo eliminado del carrito
fr: Article supprimé du panier
hi: आइटम कार्ट से हटाया गया
pt: Item removido do carrinho

# shoppingNeededFor
source: Needed for: {recipe}
ar: مطلوب لـ: {recipe}
es: Necesario para: {recipe}
fr: Nécessaire pour : {recipe}
hi: के लिए आवश्यक: {recipe}
pt: Necessário para: {recipe}

# shoppingRecipeSources
source: Recipe Sources
ar: مصادر الوصفات
es: Fuentes de Recetas
fr: Sources de Recettes
hi: रेसिपी स्रोत
pt: Fontes de Receitas

# shoppingAddQuantity
source: Add Quantity
ar: إضافة كمية
es: Añadir Cantidad
fr: Ajouter Quantité
hi: मात्रा जोड़ें
pt: Adicionar Quantidade

# generalRemove
source: Remove
ar: إزالة
es: Eliminar
fr: Supprimer
hi: हटाएं
pt: Remover

# pantryAddToPantry
source: Add to Pantry
ar: أضف للمخزن
es: Añadir a la Despensa
fr: Ajouter au Garde-manger
hi: पेंट्री में जोड़ें
pt: Adicionar à Despensa

# pantryIngredientNameLabel
source: Ingredient Name
ar: اسم المكون
es: Nombre del Ingrediente
fr: Nom de l'Ingrédient
hi: सामग्री का नाम
pt: Nome do Ingrediente

# pantryQuantityOpt
source: Quantity (Opt.)
ar: الكمية (اختياري)
es: Cantidad (Opc.)
fr: Quantité (Opt.)
hi: मात्रा (वैकल्पिक)
pt: Quantidade (Opc.)

# pantryAddedDate
source: Added: {date}
ar: أضيف: {date}
es: Añadido: {date}
fr: Ajouté : {date}
hi: जोड़ा गया: {date}
pt: Adicionado: {date}

# pantryIngredientRemoved
source: Ingredient removed from pantry
ar: تم إزالة المكون من المخزن
es: Ingrediente eliminado de la despensa
fr: Ingrédient supprimé du garde-manger
hi: सामग्री पेंट्री से हटाई गई
pt: Ingrediente removido da despensa

# pantryRemoveMessage
source: Are you sure you want to remove {name} from your pantry?
ar: هل أنت متأكد من إزالة {name} من مخزنك؟
es: ¿Estás seguro de eliminar {name} de tu despensa?
fr: Êtes-vous sûr de vouloir supprimer {name} de votre garde-manger ?
hi: क्या आप {name} को पेंट्री से हटाना चाहते हैं?
pt: Tem certeza que deseja remover {name} da despensa?

# settingsTitle
source: Settings
ar: الإعدادات
es: Configuración
fr: Paramètres
hi: सेटिंग्स
pt: Configurações

# settingsAccount
source: Account
ar: الحساب
es: Cuenta
fr: Compte
hi: खाता
pt: Conta

# settingsProfile
source: Profile
ar: الملف الشخصي
es: Perfil
fr: Profil
hi: प्रोफाइल
pt: Perfil

# settingsSubscription
source: Subscription
ar: الاشتراك
es: Suscripción
fr: Abonnement
hi: सदस्यता
pt: Assinatura

# settingsHousehold
source: Household
ar: العائلة
es: Hogar
fr: Foyer
hi: परिवार
pt: Família

# settingsPreferences
source: Preferences
ar: التفضيلات
es: Preferencias
fr: Préférences
hi: प्राथमिकताएं
pt: Preferências

# settingsDietary
source: Dietary Preferences
ar: التفضيلات الغذائية
es: Preferencias Dietéticas
fr: Préférences Alimentaires
hi: आहार प्राथमिकताएं
pt: Preferências Alimentares

# settingsPersonalizeAI
source: Personalize AI Chef
ar: تخصيص الشيف الذكي
es: Personalizar Chef IA
fr: Personnaliser le Chef IA
hi: AI शेफ कस्टमाइज़ करें
pt: Personalizar Chef IA

# settingsLanguage
source: Language
ar: اللغة
es: Idioma
fr: Langue
hi: भाषा
pt: Idioma

# settingsBiometrics
source: Biometric Login
ar: تسجيل الدخول البيومتري
es: Inicio Biométrico
fr: Connexion Biométrique
hi: बायोमेट्रिक लॉगिन
pt: Login Biométrico

# settingsRememberMe
source: Remember Me
ar: تذكرني
es: Recordarme
fr: Se Souvenir de Moi
hi: मुझे याद रखें
pt: Lembrar-me

# settingsAbout
source: About
ar: حول التطبيق
es: Acerca de
fr: À Propos
hi: के बारे में
pt: Sobre

# settingsChefLabs
source: Chef Labs
ar: مختبر الشيف
hi: शेफ लैब्स

# settingsVersion
source: Version
ar: الإصدار
es: Versión
hi: संस्करण
pt: Versão

# settingsLogout
source: Log Out
ar: تسجيل الخروج
es: Cerrar Sesión
fr: Déconnexion
hi: लॉग आउट
pt: Sair

# settingsLogoutConfirm
source: Are you sure you want to log out?
ar: هل أنت متأكد من تسجيل الخروج؟
es: ¿Estás seguro de que quieres cerrar sesión?
fr: Êtes-vous sûr de vouloir vous déconnecter ?
hi: क्या आप वाकई लॉग आउट करना चाहते हैं?
pt: Tem certeza que deseja sair?

# settingsDeleteAccount
source: Delete Account
ar: حذف الحساب
es: Eliminar Cuenta
fr: Supprimer le Compte
hi: खाता हटाएं
pt: Excluir Conta

# settingsDeleteAccountConfirm
source: This will permanently delete your account and all data.
ar: سيتم حذف حسابك وجميع بياناتك نهائياً.
es: Esto eliminará permanentemente tu cuenta y todos tus datos.
fr: Cela supprimera définitivement votre compte et toutes vos données.
hi: यह आपके खाते और सभी डेटा को स्थायी रूप से हटा देगा।
pt: Isso excluirá permanentemente sua conta e dados.

# settingsConfirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور
es: Confirmar Contraseña
fr: Confirmer le Mot de Passe
hi: पासवर्ड की पुष्टि करें
pt: Confirmar Senha

# settingsEnterPassword
source: Enter your password to continue
ar: أدخل كلمة المرور للمتابعة
es: Introduce tu contraseña para continuar
fr: Entrez votre mot de passe pour continuer
hi: जारी रखने के लिए पासवर्ड दर्ज करें
pt: Digite sua senha para continuar

# subscriptionTitle
source: Subscription Plans
ar: خطط الاشتراك
es: Planes de Suscripción
fr: Plans d'Abonnement
hi: सदस्यता योजनाएं
pt: Planos de Assinatura

# subscriptionCurrentPlan
source: Current Plan
ar: الخطة الحالية
es: Plan Actual
fr: Plan Actuel
hi: वर्तमान योजना
pt: Plano Atual

# subscriptionHomeCook
source: Home Cook
ar: طباخ منزلي
es: Cocinero Casero
fr: Cuisinier Maison
hi: होम कुक
pt: Cozinheiro Caseiro

# subscriptionSousChef
source: Sous Chef
ar: مساعد شيف
hi: सू शेफ

# subscriptionExecutiveChef
source: Executive Chef
ar: شيف تنفيذي
es: Chef Ejecutivo
fr: Chef Exécutif
hi: एग्जीक्यूटिव शेफ
pt: Chef Executivo

# subscriptionFree
source: Free
ar: مجاني
es: Gratis
fr: Gratuit
hi: मुफ्त
pt: Grátis

# subscriptionPerMonth
source: /month
ar: /شهرياً
es: /mes
fr: /mois
hi: /महीना
pt: /mês

# subscriptionPerYear
source: /year
ar: /سنوياً
es: /año
fr: /an
hi: /साल
pt: /ano

# subscriptionUpgrade
source: Upgrade
ar: ترقية
es: Mejorar
fr: Passer au Supérieur
hi: अपग्रेड करें
pt: Atualizar

# subscriptionDowngrade
source: Downgrade
ar: تخفيض
es: Degradar
fr: Rétrograder
hi: डाउनग्रेड करें
pt: Rebaixar

# subscriptionRestore
source: Restore Purchases
ar: استعادة المشتريات
es: Restaurar Compras
fr: Restaurer les Achats
hi: खरीदारी पुनर्स्थापित करें
pt: Restaurar Compras

# subscriptionFeatures
source: Features
ar: المميزات
es: Características
fr: Fonctionnalités
hi: सुविधाएं
pt: Recursos

# subscriptionUnlimitedRecipes
source: Unlimited Recipes
ar: وصفات غير محدودة
es: Recetas Ilimitadas
fr: Recettes Illimitées
hi: असीमित रेसिपी
pt: Receitas Ilimitadas

# subscriptionAdvancedDietary
source: Advanced Dietary Intelligence
ar: ذكاء غذائي متقدم
es: Inteligencia Dietética Avanzada
fr: Intelligence Diététique Avancée
hi: उन्नत आहार बुद्धिमत्ता
pt: Inteligência Alimentar Avançada

# subscriptionHouseholdSharing
source: Household Sharing
ar: مشاركة عائلية
es: Compartir en Hogar
fr: Partage Familial
hi: परिवार साझाकरण
pt: Compartilhamento Familiar

# subscriptionPrioritySupport
source: Priority Support
ar: دعم ذو أولوية
es: Soporte Prioritario
fr: Support Prioritaire
hi: प्राथमिकता सहायता
pt: Suporte Prioritário

# subscriptionNoAds
source: No Ads
ar: بدون إعلانات
es: Sin Anuncios
fr: Sans Publicités
hi: कोई विज्ञापन नहीं
pt: Sem Anúncios

# subscriptionLimitedRecipes
source: Limited Recipes
ar: وصفات محدودة
es: Recetas Limitadas
fr: Recettes Limitées
hi: सीमित रेसिपी
pt: Receitas Limitadas

# subscriptionBasicFeatures
source: Basic Features
ar: مميزات أساسية
es: Características Básicas
fr: Fonctionnalités de Base
hi: बुनियादी सुविधाएं
pt: Recursos Básicos

# authWelcome
source: Welcome to ChefMind AI
ar: مرحباً بك في شيف مايند
es: Bienvenido a ChefMind AI
fr: Bienvenue sur ChefMind AI
hi: शेफमाइंड AI में आपका स्वागत है
pt: Bem-vindo ao ChefMind AI

# authTagline
source: Your AI-powered kitchen companion
ar: مساعدك الذكي في المطبخ
es: Tu asistente de cocina con IA
fr: Votre assistant culinaire intelligent
hi: आपका AI किचन सहायक
pt: Seu assistente de cozinha com IA

# authLogin
source: Login
ar: تسجيل الدخول
es: Iniciar Sesión
fr: Connexion
hi: लॉग इन
pt: Entrar

# authSignup
source: Sign Up
ar: إنشاء حساب
es: Registrarse
fr: Inscription
hi: साइन अप
pt: Cadastrar

# authEmail
source: Email
ar: البريد الإلكتروني
es: Correo Electrónico
hi: ईमेल

# authPassword
source: Password
ar: كلمة المرور
es: Contraseña
fr: Mot de Passe
hi: पासवर्ड
pt: Senha

# authConfirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور
es: Confirmar Contraseña
fr: Confirmer le Mot de Passe
hi: पासवर्ड की पुष्टि करें
pt: Confirmar Senha

# authForgotPassword
source: Forgot Password?
ar: نسيت كلمة المرور؟
es: ¿Olvidaste tu Contraseña?
fr: Mot de Passe Oublié ?
hi: पासवर्ड भूल गए?
pt: Esqueceu a Senha?

# authResetPassword
source: Reset Password
ar: إعادة تعيين كلمة المرور
es: Restablecer Contraseña
fr: Réinitialiser le Mot de Passe
hi: पासवर्ड रीसेट करें
pt: Redefinir Senha

# authContinueWithGoogle
source: Continue with Google
ar: المتابعة مع جوجل
es: Continuar con Google
fr: Continuer avec Google
hi: Google से जारी रखें
pt: Continuar com Google

# authContinueWithApple
source: Continue with Apple
ar: المتابعة مع آبل
es: Continuar con Apple
fr: Continuer avec Apple
hi: Apple से जारी रखें
pt: Continuar com Apple

# authContinueAsGuest
source: Continue as Guest
ar: المتابعة كضيف
es: Continuar como Invitado
fr: Continuer en tant qu'Invité
hi: अतिथि के रूप में जारी रखें
pt: Continuar como Visitante

# authAlreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟
es: ¿Ya tienes una cuenta?
fr: Vous avez déjà un compte ?
hi: पहले से खाता है?
pt: Já tem uma conta?

# authDontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
es: ¿No tienes una cuenta?
fr: Vous n'avez pas de compte ?
hi: खाता नहीं है?
pt: Não tem uma conta?
