Repository: rawadaridi96/ChefMindAI
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fr, hi, pt

# guidePantryRefineDesc
source: Use filters to set specific items or vibes to include.
es: Usa filtros para incluir artículos o vibras específicas.
fr: Utilisez des filtres pour inclure des articles précis.
hi: विशिष्ट वस्तुओं को शामिल करने के लिए फ़िल्टर का उपयोग करें।
pt: Use filtros para incluir itens específicos.

# guidePantryGenerate
source: Generate Magic
es: Generar Magia
fr: Générer Magia
hi: जादू जनरेट करें
pt: Gerar Magia

# guidePantryGenerateDesc
source: Create recipes that use your existing ingredients to save time and money.
es: Crea recetas que usan tus ingredientes existentes para ahorrar tiempo.
fr: Créez des recettes utilisant vos ingrédients existants.
hi: अपनी मौजूदा सामग्री का उपयोग करके रेसिपी बनाएं।
pt: Crie receitas usando ingredientes existentes.

# guideImportStep
source: Importing
es: Importando
fr: Importation
hi: आयात
pt: Importação

# guideImportStepDesc
source: Paste links or share directly from social media.
es: Pega enlaces o comparte directamente desde redes sociales.
fr: Collez des liens ou partagez depuis les réseaux sociaux.
hi: लिंक पेस्ट करें या सोशल मीडिया से साझा करें।
pt: Cole links ou compartilhe das redes sociais.

# guideVaultLinks
source: Links Mode
es: Modo Enlaces
fr: Modo Liens
hi: लिंक मोड
pt: Modo Links

# guideVaultLinksDesc
source: Switch the toggle to view your bookmarked recipe links.
es: Cambia el interruptor para ver tus enlaces de recetas guardados.
fr: Basculez pour voir vos liens sauvegardés.
hi: अपने सहेजे गए लिंक देखने के लिए टॉगल करें।
pt: Alterne para ver seus links salvos.

# guidePantryScanner
source: Vision Scanner
es: Escáner de Visión
fr: Scanner Vision
hi: विज़न स्कैनर
pt: Scanner Visual

# guidePantryScannerDesc
source: Use the Camera to auto-scan ingredients into your pantry.
es: Usa la Cámara para auto-escanear ingredientes a tu despensa.
fr: Utilisez la Caméra pour scanner des ingrédients.
hi: सामग्री स्कैन करने के लिए कैमरे का उपयोग करें।
pt: Use a Câmera para escanear ingredientes.

# guideOfflineTitle
source: Offline Access
es: Acceso Offline
fr: Accès Hors Ligne
hi: ऑफ़लाइन पहुँच
pt: Acesso Offline

# guideOfflineDesc
source: Cook without connection.
es: Cocina sin conexión.
fr: Cuisinez sans connexion.
hi: बिना कनेक्शन के पकाएं।
pt: Cozinhe sem conexão.

# guideOfflineVault
source: The Vault
es: La Bóveda
fr: Le Coffre
hi: वॉल्ट
pt: O Cofre

# guideOfflineVaultDesc
source: Access all your saved recipes anytime, anywhere.
es: Accede a todas tus recetas guardadas en cualquier momento.
fr: Accédez à vos recettes sauvegardées partout.
hi: किसी भी समय अपनी सहेजी गई रेसिपी तक पहुंचें।
pt: Acesse suas receitas salvas a qualquer momento.

# guideOfflinePantry
source: Pantry & Cart
es: Despensa y Carrito
fr: Garde-manger & Panier
hi: पैंट्री और कार्ट
pt: Despensa & Carrinho

# guideOfflinePantryDesc
source: Manage your inventory and shopping list even when offline.
es: Gestiona tu inventario y lista de compras incluso sin conexión.
fr: Gérez votre inventaire même hors ligne.
hi: ऑफ़लाइन भी अपनी इन्वेंट्री प्रबंधित करें।
pt: Gerencie seu estoque mesmo offline.

# guideOfflineSync
source: Sync Later
es: Sincronizar Luego
fr: Synchro Plus Tard
hi: बाद में सिंक करें
pt: Sincronizar Depois

# guideCookingTools
source: Cooking Tools
es: Herramientas de Cocina
fr: Outils Cuisine
hi: कुकिंग टूल्स
pt: Ferramentas

# guideCookingToolsDesc
source: Scaling, Cooking Mode & Chef Assistant.
es: Escalado, Modo Cocina y Asistente Chef.
fr: Mise à l'échelle, Mode Cuisine & Assistant.
hi: स्केलिंग, कुकिंग मोड और शेफ अस्सिस्टेंट।
pt: Escala, Modo Cozinhar & Assistente.

# guideOfflineSyncDesc
source: Changes sync automatically when you reconnect to the internet.
es: Los cambios se sincronizan automáticamente cuando te reconectas a internet.
fr: Les changements se synchronisent à la reconnexion.
hi: फिर से कनेक्ट होने पर परिवर्तन सिंक हो जाते हैं।
pt: Mudanças sincronizam ao reconectar.

# guideExecutiveChefTier
source: Executive Chef
es: Chef Ejecutivo
fr: Chef Exécutif
hi: कार्यकारी शेफ
pt: Chef Executivo

# guideExecutiveChefTierDesc
source: Everything in Sous Chef plus family sync, shared vaults, and premium support.
es: Todo lo de Sous Chef más sincronización familiar, bóvedas compartidas y soporte premium.
fr: Tout de Sous-Chef plus synchro famille, coffres partagés et support premium.
hi: सूस शेफ सब कुछ प्लस परिवार सिंक और प्रीमियम समर्थन।
pt: Tudo do Sous Chef mais sync familiar, cofres compartilhados e suporte premium.

# guideRecipeScaling
source: Recipe Scaling
es: Escalado de Recetas
fr: Mise à l'échelle
hi: रेसिपी स्केलिंग
pt: Escala de Receita

# guideRecipeScalingDesc
source: Adjust Servings
es: Ajustar Porciones
fr: Ajuster Portions
hi: सर्विंग्स समायोजित करें
pt: Ajustar Porções

# guideScalingHow
source: Change Servings
es: Cambiar Porciones
fr: Changer Portions
hi: सर्विंग्स बदलें
pt: Mudar Porções

# guideScalingHowDesc
source: Use the serving selector on any recipe to scale ingredients up or down automatically.
es: Usa el selector de porciones para escalar ingredientes automáticamente.
fr: Utilisez le sélecteur pour ajuster les ingrédients automatiquement.
hi: सामग्री को स्वचालित रूप से समायोजित करने के लिए चयनकर्ता का उपयोग करें।
pt: Use o seletor para ajustar ingredientes automaticamente.

# guideScalingMacros
source: Auto-Updated Macros
es: Macros Auto-Actualizados
fr: Macros Auto
hi: ऑटो मैक्रो
pt: Macros Auto

# guideScalingMacrosDesc
source: Nutritional information updates automatically when you change the serving size.
es: La información nutricional se actualiza automáticamente.
fr: Les infos nutritionnelles s'ajustent automatiquement.
hi: पोषण संबंधी जानकारी अपने आप अपडेट हो जाती है।
pt: Informações nutricionais ajustam automaticamente.

# guideCookingMode
source: Cooking Mode
es: Modo Cocina
fr: Mode Cuisine
hi: कुकिंग मोड
pt: Modo Cozinhar

# guideCookingModeDesc
source: Step-by-Step Cooking
es: Cocina Paso a Paso
fr: Cuisine Pas à Pas
hi: कदम दर कदम
pt: Passo a Passo

# guideCookingStart
source: Start Cooking
es: Empezar a Cocinar
fr: Commencer
hi: खाना बनाना शुरू करें
pt: Começar

# guideCookingStartDesc
source: Tap 'Start Cooking' on any recipe to enter hands-free cooking mode.
es: Toca 'Empezar a Cocinar' para entrar en modo manos libres.
fr: Touchez 'Commencer' pour le mode mains libres.
hi: हैंड्स-फ्री मोड के लिए 'स्टार्ट कुकिंग' पर टैप करें।
pt: Toque em 'Começar' para modo mãos-livres.

# guideCookingVoice
source: Voice Instructions
es: Instrucciones de Voz
fr: Instructions Vocales
hi: वॉयस निर्देश
pt: Instruções de Voz

# guideCookingVoiceDesc
source: Each step is read aloud. Say 'Next' or tap to move to the next instruction.
es: Cada paso se lee en voz alta. Di 'Siguiente' o toca para avanzar.
fr: Chaque étape est lue. Dites 'Suivant' ou touchez pour avancer.
hi: हर कदम जोर से पढ़ा जाता है। आगे बढ़ने के लिए 'अगला' कहें।
pt: Cada passo é lido. Diga 'Próximo' ou toque para avançar.

# guideCookingTimer
source: Built-in Timers
es: Temporizadores Integrados
fr: Minuteurs Intégrés
hi: बिल्ट-इन टाइमर
pt: Timers Integrados

# guideCookingTimerDesc
source: Timers are embedded in steps. Tap to start and get notified when done.
es: Los temporizadores están integrados. Toca para iniciar.
fr: Touchez pour lancer les minuteurs intégrés.
hi: टाइमर शुरू करने के लिए टैप करें।
pt: Toque para iniciar timers integrados.

# guideChefAssistant
source: Chef Assistant
es: Asistente Chef
fr: Assistant Chef
hi: शेफ अस्सिस्टेंट
pt: Assistente Chef

# guideChefAssistantDesc
source: AI Help in Recipes
es: Ayuda IA en Recetas
fr: Aide IA
hi: एआई मदद
pt: Ajuda IA

# guideAssistantAsk
source: Ask the Chef
es: Preguntar al Chef
fr: Demander au Chef
hi: शेफ से पूछें
pt: Perguntar ao Chef

# guideAssistantAskDesc
source: Have a question about a recipe? Tap 'Ask Chef' to get real-time AI assistance.
es: ¿Tienes una pregunta? Toca 'Preguntar al Chef' para ayuda IA.
fr: Une question ? Touchez 'Demander au Chef'.
hi: कोई सवाल? 'शेफ से पूछें' पर टैप करें।
pt: Dúvida? Toque em 'Perguntar ao Chef'.

# guideAssistantSubs
source: Ingredient Substitutions
es: Sustituciones
fr: Substitutions
hi: विकल्प
pt: Substituições

# guideAssistantSubsDesc
source: Ask for alternatives like 'Can I use almond milk instead?' and get instant answers.
es: Pide alternativas como '¿Puedo usar leche de almendras?' y obtén respuestas.
fr: Demandez des alternatives instantanément.
hi: तुरंत विकल्प मांगें।
pt: Peça alternativas instantaneamente.

# guideAssistantTechniques
source: Cooking Techniques
es: Técnicas de Cocina
fr: Techniques de Cuisine
hi: तकनीक
pt: Técnicas

# guideAssistantTechniquesDesc
source: Unsure about a method? Ask the Chef to explain any technique in the recipe.
es: ¿Inseguro sobre un método? Pide al Chef que explique.
fr: Demandez au Chef d'expliquer une technique.
hi: शेफ से किसी भी तकनीक को समझाने के लिए कहें।
pt: Peça ao Chef para explicar uma técnica.

# toastErrorGeneric
source: Error: {error}
fr: Erreur : {error}
hi: त्रुटि: {error}
pt: Erro: {error}

# toastRunningBackground
source: Running in background...
es: Ejecutando en segundo plano...
fr: Exécution en arrière-plan...
hi: बैकग्राउंड में चल रहा है...
pt: Executando em segundo plano...

# toastLinkSaved
source: Link Saved to Vault! 📂
es: ¡Enlace Guardado en Bóveda! 📂
fr: Lien sauvegardé ! 📂
hi: लिंक सहेजा गया! 📂
pt: Link Salvo! 📂

# toastRecipeSaved
source: Recipe saved to your Vault! 📥
es: ¡Receta guardada en tu Bóveda! 📥
fr: Recette sauvegardée ! 📥
hi: रेसिपी सहेजी गई! 📥
pt: Receita Salva! 📥

# toastRecipeNotFound
source: Recipe not found or access denied.
es: Receta no encontrada o acceso denegado.
fr: Recette non trouvée.
hi: रेसिपी नहीं मिली।
pt: Receita não encontrada.

# toastLinkInvalid
source: Link expired or invalid.
es: Enlace expirado o inválido.
fr: Lien expiré ou invalide.
hi: लिंक अमान्य।
pt: Link inválido ou expirado.

# toastSaveFailed
source: Failed to save recipe: {error}
es: Fallo al guardar receta: {error}
fr: Échec sauvegarde : {error}
hi: सहेजने में विफल: {error}
pt: Falha ao salvar: {error}

# toastLoadFailed
source: Failed to load recipe: {error}
es: Fallo al cargar receta: {error}
fr: Échec chargement : {error}
hi: लोड करने में विफल: {error}
pt: Falha ao carregar: {error}

# toastScanFailed
source: Scan failed: {error}
es: Fallo en escaneo: {error}
fr: Échec scan : {error}
hi: स्कैन विफल: {error}
pt: Falha no scan: {error}

# toastAddedToPantry
source: Added {item} to Pantry!
es: ¡Añadido {item} a Despensa!
fr: Ajouté {item} au Garde-manger !
hi: {item} पैंट्री में जोड़ा गया!
pt: Adicionado {item} à Despensa!

# toastAlreadyInPantry
source: {item} is already in your pantry.
es: {item} ya está en tu despensa.
fr: {item} est déjà là.
hi: {item} पहले से ही है।
pt: {item} já está na despensa.

# toastAddedToMealPlan
source: Added to Meal Plan!
es: ¡Añadido al Plan de Comidas!
fr: Ajouté au Plan Repas !
hi: भोजन योजना में जोड़ा गया!
pt: Adicionado ao Plano!

# toastRemovedFromPlan
source: Removed from plan
es: Eliminado del plan
fr: Retiré du plan
hi: योजना से हटाया गया
pt: Removido do plano

# toastCookingCompleted
source: Recipe Completed! Bon Appétit!
es: ¡Receta Completada!
fr: Recette Terminée !
hi: रेसिपी पूरी हुई!
pt: Receita Completa!

# toastSpeechUnavailable
source: Speech recognition not available
es: Voz no disponible
fr: Reconnaissance vocale indisponible
hi: भाषण उपलब्ध नहीं है
pt: Voz indisponível

# toastPurchasesRestored
source: Purchases restored!
es: ¡Compras restauradas!
fr: Achats restaurés !
hi: खरीदारी बहाल!
pt: Compras restauradas!

# toastRestoreFailed
source: Restore failed.
es: Fallo en restauración.
fr: Échec restauration.
hi: बहाली विफल।
pt: Falha na restauração.

# toastNoOffers
source: No offers available.
es: No hay ofertas disponibles.
fr: Pas d'offres.
hi: कोई ऑफ़र नहीं।
pt: Sem ofertas.

# toastPurchaseFailed
source: Purchase failed: {error}
es: Fallo en compra: {error}
fr: Échec achat : {error}
hi: खरीद विफल: {error}
pt: Falha na compra: {error}

# toastManageDowngrades
source: Manage downgrades in your Store settings.
es: Gestiona degradaciones en la configuración de la Tienda.
fr: Gérez les déclassements dans les paramètres du Store.
hi: स्टोर सेटिंग्स में डाउनग्रेड प्रबंधित करें।
pt: Gerencie downgrades nas configurações da Loja.

# mealPlanEmpty
source: No meals planned
es: Sin comidas planeadas
fr: Aucun repas prévu
hi: कोई योजना नहीं
pt: Sem refeições planejadas

# mealPlanNoRecipes
source: No saved recipes found. Go to Recipes to save some!
es: No se encontraron recetas guardadas.
fr: Aucune recette sauvegardée.
hi: कोई सहेजी गई रेसिपी नहीं।
pt: Nenhuma receita salva.

# mealPlanAddTo
source: Add to {type}
es: Añadir a {type}
fr: Ajouter à {type}
hi: {type} में जोड़ें
pt: Adicionar a {type}

# mealTypeBreakfast
source: Breakfast
es: Desayuno
fr: Petit-déjeuner
hi: नाश्ता
pt: Café da Manhã

# mealTypeLunch
source: Lunch
es: Almuerzo
fr: Déjeuner
hi: दोपहर का भोजन
pt: Almoço

# mealTypeDinner
source: Dinner
es: Cena
fr: Dîner
hi: रात का खाना
pt: Jantar

# mealTypeSnacks
source: Snacks
fr: Collations
hi: नाश्ता
pt: Lanches

# premiumVaultFullTitle
source: Vault Limit Reached
es: Límite de Bóveda
fr: Coffre Plein
hi: वॉल्ट भरा हुआ
pt: Cofre Cheio

# premiumVaultFullMessage
source: Vault is full ({limit} items).
es: La bóveda está llena ({limit} artículos).
fr: Le coffre est plein ({limit} articles).
hi: वॉल्ट भरा हुआ है ({limit} आइटम)।
pt: Cofre está cheio ({limit} itens).

# premiumShareLimitTitle
source: Daily Share Limit
es: Límite de Compartir
fr: Limite Partage
hi: साझा सीमा
pt: Limite de Compartilhamento

# premiumShareLimitMessage
source: Daily share limit reached. Upgrade for unlimited sharing!
es: Límite diario alcanzado. ¡Mejora para compartir ilimitado!
fr: Limite journalière atteinte.
hi: दैनिक सीमा पूरी हुई।
pt: Limite diário atingido.

# toastStoreNotConfigured
source: Store not configured. Please try again later.
es: Tienda no configurada.
fr: Store non configuré.
hi: स्टोर कॉन्फ़िगर नहीं है।
pt: Loja não configurada.

# toastProductNotFound
source: Product not found: {id}
es: Producto no encontrado: {id}
fr: Produit non trouvé : {id}
hi: उत्पाद नहीं मिला: {id}
pt: Produto não encontrado: {id}

# toastErrorUnexpected
source: An unexpected error occurred.
es: Error inesperado.
fr: Erreur inattendue.
hi: अनपेक्षित त्रुटि।
pt: Erro inesperado.

# dialogRemoveFromVaultTitle
source: Remove from Vault?
es: ¿Eliminar de Bóveda?
fr: Retirer du Coffre ?
hi: हटाएं?
pt: Remover do Cofre?

# dialogRemoveFromVaultMessage
source: This will remove this recipe from your saved collection.
es: Esto eliminará esta receta de tu colección.
fr: Ceci retirera la recette.
hi: यह रेसिपी को हटा देगा।
pt: Isso removerá esta receita.

# actionCancel
source: Cancel
es: Cancelar
fr: Annuler
hi: रद्द करें
pt: Cancelar

# actionRemove
source: Remove
es: Eliminar
fr: Retirer
hi: हटाएं
pt: Remover

# shareMakeVisible
source: Make visible to family members
es: Hacer visible a familia
fr: Rendre visible à la famille
hi: परिवार के लिए दृश्यमान बनाएं
pt: Tornar visível para a família

# toastJoinHouseholdFirst
source: Please join a household first.
es: Únete a un hogar primero.
fr: Rejoignez un foyer d'abord.
hi: पहले एक घर में शामिल हों।
pt: Junte-se a um lar primeiro.

# toastSharedWithHousehold
source: Shared with Household!
es: ¡Compartido con el Hogar!
fr: Partagé avec le Foyer !
hi: घर के साथ साझा किया गया!
pt: Compartilhado com o Lar!

source: Share Link
es: Compartir Enlace
fr: Partager Lien
hi: लिंक साझा करें
pt: Compartilhar Link

# shareMessage
source: Check out this recipe: {title} on ChefMind!
es: Mira esta receta: {title} en ChefMind!
fr: Regarde cette recette : {title} sur ChefMind !
hi: इस रेसिपी को देखें: {title}!
pt: Veja esta receita: {title} no ChefMind!

# addToMealPlanTitle
source: Add to Meal Plan
es: Añadir a Plan
fr: Ajouter au Plan
hi: योजना में जोड़ें
pt: Adicionar ao Plano

# labelDate
source: Date:
es: Fecha:
hi: तारीख:
pt: Data:

# labelMealType
source: Meal Type:
es: Tipo de Comida:
fr: Type :
hi: प्रकार:
pt: Tipo:

# actionAddToPlan
source: Add to Plan
es: Añadir a Plan
fr: Ajouter
hi: जोड़ें
pt: Adicionar

# sectionMainIngredients
source: Main Ingredients
es: Ingredientes Principales
fr: Ingredientes Principaux
hi: मुख्य सामग्री
pt: Ingredientes Principais

# toastAddedToList
source: Added to list
es: Añadido a lista
fr: Ajouté à la liste
hi: सूची में जोड़ा गया
pt: Adicionado à lista

# dialogSaveRecipeFirstTitle
source: Save Recipe First
es: Guardar Primero
fr: Sauvegarder D'abord
hi: पहले सहेजें
pt: Salvar Primeiro

# dialogSaveRecipeFirstMessage
source: To add a photo, this recipe must be saved to your Vault.
es: Para añadir foto, guarda la receta.
fr: Pour ajouter une photo, sauvegardez la recette.
hi: फोटो जोड़ने के लिए, रेसिपी सहेजें।
pt: Para adicionar foto, salve a receita.

# actionSaveToVault
source: Save to Vault
es: Guardar
fr: Sauvegarder
hi: सहेजें
pt: Salvar

# toastUploadingPhoto
source: Uploading photo...
es: Subiendo foto...
fr: Téléchargement photo...
hi: फोटो अपलोड हो रही है...
pt: Enviando foto...

# toastPhotoAdded
source: Photo added successfully!
es: ¡Foto añadida!
fr: Photo ajoutée !
hi: फोटो जोड़ी गई!
pt: Foto adicionada!

# toastUploadFailed
source: Upload failed: {error}
es: Fallo en subida: {error}
fr: Échec : {error}
hi: विफल: {error}
pt: Falha: {error}

# generalRetry
source: Retry
ar: إعادة المحاولة

# generalOops
source: Oops! Something went wrong.
ar: عفواً! حدث خطأ ما.

# homeDietaryProfile
source: Dietary Profile
ar: الملف الغذائي

# homeClear
source: Clear
ar: مسح

# homeMoodComfort
source: Comfort
ar: راحة

# homeMoodDateNight
source: Date Night
ar: سهرة رومانسية

# homeMoodQuickEasy
source: Quick & Easy
ar: سريع وسهل

# homeMoodEnergetic
source: Energetic
ar: منشط

# homeMoodAdventurous
source: Adventurous
ar: مغامر

# homeMoodFancy
source: Fancy
ar: فاخر

# dietaryPescatarian
source: Pescatarian
ar: نباتي بحري

# settingsExperimentalFeatures
source: Experimental Features
ar: ميزات تجريبية

# settingsSousChefPlus
source: Sous Chef+
ar: شيف مساعد+

# tierHomeCook
source: Home Cook
ar: طباخ منزلي

# tierSousChef
source: Sous Chef
ar: شيف مساعد

# tierExecutiveChef
source: Executive Chef
ar: شيف تنفيذي

# tierFree
source: Free Tier
ar: نسخة مجانية
