Repository: rawadaridi96/ChefMindAI
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fr, hi, pt

# scanFailed
source: Scan failed: {error}
ar: فشل المسح: {error}
es: Fallo en el escaneo: {error}
fr: Échec du scan : {error}
hi: स्कैन विफल: {error}
pt: Falha no escaneamento: {error}

# scanError
source: Error: {error}
ar: خطأ: {error}
fr: Erreur : {error}
hi: त्रुटि: {error}
pt: Erro: {error}

# scannerAIFoundItems
source: Found Items
ar: العناصر المكتشفة
es: Artículos Encontrados
fr: Articles Trouvés
hi: मिले आइटम
pt: Itens Encontrados

# scannerUncheckMistakes
source: Uncheck any mistakes
ar: قم بإلغاء تحديد أي أخطاء
es: Desmarca cualquier error
fr: décochez les erreurs
hi: गलतियों को अनचेक करें
pt: Desmarque quaisquer erros

# scannerItemAlreadyInPantry
source: Already in Pantry
ar: موجود بالفعل في المخزن
es: Ya en la Despensa
fr: Déjà dans le Garde-manger
hi: पहले से पेंट्री में
pt: Já na Despensa

# scannerAddedToPantry
source: Added {count} items to Pantry!
ar: تم إضافة {count} عناصر للمخزن!
es: ¡Añadidos {count} artículos a la Despensa!
fr: Ajouté {count} articles au Garde-manger !
hi: पेंट्री में {count} आइटम जोड़े गए!
pt: Adicionado {count} itens à Despensa!

# scannerAddItemsToPantry
source: Add {count} Items
ar: إضافة {count} عنصر
es: Añadir {count} Artículos
fr: Ajouter {count} Articles
hi: {count} आइटम जोड़ें
pt: Adicionar {count} Itens

# homeError
source: Error: {error}
ar: خطأ: {error}
fr: Erreur : {error}
hi: त्रुटि: {error}
pt: Erro: {error}

# settingsShowDetails
source: Show details
ar: عرض التفاصيل
es: Mostrar detalles
fr: Afficher les détails
hi: विवरण दिखाएं
pt: Mostrar detalhes

# settingsSignupToSave
source: Sign up to save your settings
ar: سجل لحفظ إعداداتك
es: Regístrate para guardar tus ajustes
fr: Inscrivez-vous pour enregistrer vos paramètres
hi: सेटिंग्स सहेजने के लिए साइन अप करें
pt: Cadastre-se para salvar configurações

# settingsNotifications
source: Push Notifications
ar: الإشعارات
es: Notificaciones
fr: Notifications
hi: सूचनाएं
pt: Notificações

# settingsSubscriptionBilling
source: Subscription & Billing
ar: الاشتراك والفوترة
es: Suscripción y Facturación
fr: Abonnement & Facturation
hi: सदस्यता और बिलिंग
pt: Assinatura e Cobrança

# settingsUserDetailsUsername
source: Username
ar: اسم المستخدم
es: Usuario
fr: Nom d'utilisateur
hi: उपयोगकर्ता नाम
pt: Nome de Usuário

# settingsUserDetailsEmail
source: Email
ar: البريد الإلكتروني
hi: ईमेल

# settingsUserDetailsPlan
source: Plan
ar: الخطة
hi: योजना
pt: Plano

# settingsUserDetailsMemberId
source: Member ID
ar: رقم العضوية
es: ID Miembro
fr: ID Membre
hi: सदस्य आईडी
pt: ID Membro

# settingsEditProfile
source: Edit Profile
ar: تعديل الملف الشخصي
es: Editar Perfil
fr: Modifier le Profil
hi: प्रोफ़ाइल संपादित करें
pt: Editar Perfil

# settingsChooseFromLibrary
source: Choose from Library
ar: اختيار من المعرض
es: Elegir de Biblioteca
fr: Choisir depuis la Bibliothèque
hi: लाइब्रेरी से चुनें
pt: Escolher da Biblioteca

# settingsRemovePhoto
source: Remove Photo
ar: إزالة الصورة
es: Eliminar Foto
fr: Retirer la Photo
hi: फोटो हटाएं
pt: Remover Foto

# settingsEnterNewPassword
source: Enter a new password only if you want to change it.
ar: أدخل كلمة مرور جديدة فقط إذا كنت تريد تغييرها.
es: Introduce una nueva contraseña solo si quieres cambiarla.
fr: Entrez un nouveau mot de passe uniquement si vous souhaitez le changer.
hi: नया पासवर्ड दर्ज करें
pt: Digite nova senha (se quiser alterar)

# settingsLeaveBlank
source: Leave blank to keep current
ar: اتركه فارغاً للاحتفاظ بالحالية
es: Dejar en blanco para mantener la actual
fr: Laisser vide pour conserver l'actuel
hi: वर्तमान रखने के लिए खाली छोड़ें
pt: Deixe em branco para manter

# settingsReEnterPassword
source: Re-enter new password
ar: أعد إدخال كلمة المرور الجديدة
es: Reingresar contraseña
fr: Ressaisir le nouveau mot de passe
hi: नया पासवर्ड फिर से दर्ज करें
pt: Redigite nova senha

# settingsNewPassword
source: New Password
ar: كلمة المرور الجديدة
es: Nueva Contraseña
fr: Nouveau Mot de Passe
hi: नया पासवर्ड
pt: Nova Senha

# settingsSecurity
source: Security
ar: الأمان
es: Seguridad
fr: Sécurité
hi: सुरक्षा
pt: Segurança

# settingsNameEmpty
source: Name cannot be empty
ar: الاسم لا يمكن أن يكون فارغاً
es: El nombre no puede estar vacío
fr: Le nom ne peut pas être vide
hi: नाम खाली नहीं हो सकता
pt: Nome não pode ser vazio

# settingsProfileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح
es: Perfil actualizado con éxito
fr: Profil mis à jour avec succès
hi: प्रोफ़ाइल अपडेट किया गया
pt: Perfil atualizado

# settingsProfilePicUpdated
source: Profile picture updated
ar: تم تحديث الصورة الشخصية
es: Foto de perfil actualizada
fr: Photo de profil mise à jour
hi: प्रोफ़ाइल फोटो अपडेट की गई
pt: Foto atualizada

# settingsProfilePicRemoved
source: Profile picture removed
ar: تم إزالة الصورة الشخصية
es: Foto de perfil eliminada
fr: Photo de profil retirée
hi: प्रोफ़ाइल फोटो हटाई गई
pt: Foto removida

# settingsUploadFailed
source: Upload failed
ar: فشل التحميل
es: Fallo en la subida
fr: Échec du téléchargement
hi: अपलोड विफल
pt: Falha no upload

# settingsRemoveFailed
source: Failed to remove image
ar: فشل إزالة الصورة
es: Fallo al eliminar imagen
fr: Échec de la suppression de l'image
hi: छवि हटाने में विफल
pt: Falha ao remover imagem

# settingsSave
source: Save
ar: حفظ
es: Guardar
fr: Enregistrer
hi: सहेजें
pt: Salvar

# subscriptionMonthly
source: Monthly
ar: شهري
es: Mensual
fr: Mensuel
hi: मासिक
pt: Mensal

# subscriptionYearlySave
source: Yearly (Save 20%)
ar: سنوي (وفر 20%)
es: Anual (Ahorra 20%)
fr: Annuel (Économisez 20%)
hi: वार्षिक (20% बचाएं)
pt: Anual (Economize 20%)

# subscriptionFreeForever
source: Free Forever
ar: مجاني للأبد
es: Gratis por siempre
fr: Gratuit pour Toujours
hi: हमेशा के लिए मुफ्त
pt: Grátis para Sempre

# subscriptionAIRecipesDay
source: 5 AI Recipes/day
ar: 5 وصفات ذكية/يومياً
es: 5 Recetas IA/día
fr: 5 Recettes IA/jour
hi: 5 AI रेसिपी/दिन
pt: 5 Receitas IA/dia

# subscriptionSave3Favorites
source: Save 3 Favorites
ar: حفظ 3 مفضلات
es: Guardar 3 Favoritos
fr: Enregistrer 3 Favoris
hi: 3 पसंदीदा सहेजें
pt: Salvar 3 Favoritos

# subscriptionDailyLinkShares
source: 5 Daily Link Shares
ar: 5 مشاركات يومية
es: 5 Compartir Enlaces/día
fr: 5 Partages de Lien Quotidiens
hi: 5 दैनिक लिंक शेयर
pt: 5 Compartilhamentos/dia

# subscriptionUnlimitedAI
source: Unlimited AI Recipes
ar: وصفات ذكية غير محدودة
es: Recetas IA Ilimitadas
fr: Recettes IA Illimitées
hi: असीमित AI रेसिपी
pt: IA Ilimitada

# subscriptionFullLinkScraper
source: AI Video to Recipe Analysis
ar: استخراج كامل للروابط
es: Importador Completo de Enlaces
fr: Importation Complète de Liens
hi: पूर्ण लिंक आयातक
pt: Importador Completo de Links

# subscriptionUnlimitedVault
source: Unlimited Vault Saves
ar: حفظ غير محدود
es: Guardados Bóveda Ilimitados
fr: Enregistrements Coffre Illimités
hi: असीमित वॉल्ट सहेजें
pt: Cofre Ilimitado

# subscriptionUnlimitedSharing
source: Unlimited Link Sharing
ar: مشاركة غير محدودة
es: Compartir Ilimitado
fr: Partage de Liens Illimité
hi: असीमित सजेयरिंग
pt: Compartilhamento Ilimitado

# subscriptionHighSpeedAI
source: High-Speed AI Generation
ar: ذكاء اصطناعي فائق السرعة
es: Generación IA Alta Velocidad
fr: Génération IA Haute Vitesse
hi: हाई-स्पीड AI जनरेशन
pt: IA Alta Velocidade

# subscriptionMoodSuggestions
source: Mood-Based Suggestions
ar: اقتراحات حسب المزاج
es: Sugerencias por Humor
fr: Suggestions Basées sur l'Humeur
hi: मूड-आधारित सुझाव
pt: Sugestões de Humor

# subscriptionFamilySync
source: Family Sync (Kitchen Vault)
ar: مزامنة العائلة
es: Sync Familiar (Bóveda Cocina)
fr: Sync Familiale (Coffre Cuisine)
hi: पारिवारिक सिंक (किचन वॉल्ट)
pt: Sync Familiar (Cofre Cozinha)

# subscriptionPriorityAccess
source: Priority Early Access
ar: وصول مبكر
es: Acceso Prioritario
fr: Accès Prioritaire
hi: प्राथमिकता पहुंच
pt: Acesso Prioritário

# subscriptionUpgradeTo
source: Upgrade to {tier}
ar: ترقية إلى {tier}
es: Mejorar a {tier}
fr: Passer à {tier}
hi: {tier} में अपग्रेड करें
pt: Atualizar para {tier}

# subscriptionDowngradeTo
source: Downgrade to {tier}
ar: تخفيض إلى {tier}
es: Degradar a {tier}
fr: Rétrograder à {tier}
hi: {tier} में डाउनग्रेड करें
pt: Rebaixar para {tier}

# subscriptionGoExecutive
source: Go Executive
ar: انتقل للتنفيذي
es: Ser Ejecutivo
fr: Devenir Exécutif
hi: एग्जीक्यूटिव बनें
pt: Virar Executivo

# subscriptionMostPopular
source: MOST POPULAR
ar: الأكثر شعبية
es: MÁS POPULAR
fr: LE PLUS POPULAIRE
hi: सबसे लोकप्रिय
pt: MAIS POPULAR

# subscriptionBilledYearly
source: Billed {amount} yearly
ar: تُدفع {amount} سنوياً
es: Facturado {amount} anual
fr: Facturé {amount} par an
hi: {amount} वार्षिक बिल
pt: Faturado {amount} anualmente

# subscriptionPlanUpdated
source: Plan updated successfully!
ar: تم تحديث الخطة بنجاح!
es: ¡Plan actualizado con éxito!
fr: Plan mis à jour avec succès !
hi: योजना अपडेट की गई!
pt: Plano atualizado com sucesso!

# subscriptionPlanUpdateFailed
source: Failed to update plan
ar: فشل تحديث الخطة
es: Fallo al actualizar plan
fr: Échec de la mise à jour du plan
hi: योजना अपडेट विफल
pt: Falha ao atualizar plano

# generatorMealTypeBreakfast
source: Breakfast
ar: إفطار
es: Desayuno
fr: Petit-déjeuner
hi: नाश्ता
pt: Café da Manhã

# generatorMealTypeMainMeal
source: Main Meal
ar: وجبة رئيسية
es: Comida Principal
fr: Repas Principal
hi: मुख्य भोजन
pt: Refeição Principal

# generatorMealTypeDessert
source: Dessert
ar: حلى
es: Postre
hi: मिठाई
pt: Sobremesa

# generatorMealTypeSnack
source: Snack
ar: وجبة خفيفة
fr: Collation
hi: स्नैक
pt: Lanche

# generatorMealTypeSurpriseMe
source: Surprise Me
ar: فاجئني
es: Sorpréndeme
fr: Surprenez-moi
hi: मुझे आश्चर्यचकित करें
pt: Surpreenda-me

# generatorVibe
source: Vibe
ar: المزاج:
fr: Ambiance :
hi: माहौल:

# generatorFilterGourmet
source: Gourmet
ar: ذواقة
hi: गोउरमेट

# generatorFilterHealthy
source: Healthy
ar: صحي
es: Saludable
fr: Sain
hi: स्वस्थ
pt: Saudável

# generatorFilter15Min
source: 15-min
ar: 15 دقيقة
hi: 15-मिनट

# generatorFilterComfort
source: Comfort
ar: مريح
es: Confort
fr: Réconfort
hi: आरामदायक
pt: Conforto

# generatorFilterExotic
source: Exotic
ar: غريب
es: Exótico
fr: Exotique
hi: विदेशी
pt: Exótico

# generatorFilterVegan
source: Vegan
ar: نباتي صرف
es: Vegano
fr: Végan
hi: वीगन
pt: Vegano

# generatorFilterKeto
source: Keto
ar: كيتو
hi: कीटो

# generatorFilterLowCarb
source: Low Carb
ar: قليل الكربوهيدرات
es: Bajo Carb
fr: Faible Glucides
hi: कम कार्ब
pt: Baixo Carb

# generatorFilterHighProtein
source: High Protein
ar: عالي البروتين
es: Alto Proteína
fr: Protéiné
hi: उच्च प्रोटीन
pt: Alta Proteína

# generatorFiltersAndDiet
source: Filters & Diet
ar: الفلاتر والنظام الغذائي
es: Filtros y Dieta
fr: Filtres & Régime
hi: फ़िल्टर और आहार
pt: Filtros e Dieta

# generatorAllergiesExclusions
source: Allergies / Exclusions
ar: الحساسية / الاستثناءات
es: Alergias / Exclusiones
hi: एलर्जी / बहिष्कार
pt: Alergias / Exclusões

# generatorAllergiesHint
source: e.g. No Nuts, Gluten Free
ar: مثال: بدون مكسرات، خالي من الجلوتين
es: Ej: Sin Nueces, Sin Gluten
fr: Ex: Pas de Noix, Sans Gluten
hi: उदाहरण: नट नहीं, ग्लूटेन मुक्त
pt: Ex: Sem Nozes, Sem Glúten

# generatorGenerateRecipes
source: Generate Recipes
ar: إنشاء وصفات
es: Generar Recetas
fr: Générer Recettes
hi: रेसिपी उत्पन्न करें
pt: Gerar Receitas

# generatorPantryEmptyTitle
source: Your pantry is empty!
ar: مخزنك فارغ!
es: ¡Tu despensa está vacía!
fr: Votre garde-manger est vide !
hi: आपकी पेंट्री खाली है!
pt: Sua despensa está vazia!

# generatorPantryEmptyDesc
source: Please add items or use Global Search.
ar: الرجاء إضافة عناصر أو استخدام البحث العام.
es: Por favor añade artículos o usa la Búsqueda Global.
fr: Veuillez ajouter des articles ou utiliser la Recherche Globale.
hi: कृपया आइटम जोड़ें या वैश्विक खोज का उपयोग करें।
pt: Adicione itens ou use a Busca Global.

# generatorCuisine
source: Cuisine
ar: المطبخ
es: Cocina
hi: व्यंजन
pt: Culinária

# generatorMaxTime
source: Max Time
ar: الوقت الأقصى
es: Tiempo Máximo
fr: Temps Max
hi: अधिकतम समय
pt: Tempo Máximo

# generatorSkillLevel
source: Skill Level
ar: المستوى
es: Nivel de Habilidad
fr: Niveau de Compétence
hi: कौशल स्तर
pt: Nível de Habilidade

# generatorDietaryLabels
source: Dietary Labels
ar: تسميات غذائية
es: Etiquetas Dietéticas
fr: Labels Diététiques
hi: आहार लेबल
pt: Rótulos Dietéticos

# generatorReset
source: Reset
ar: إعادة تعيين
es: Reiniciar
fr: Réinitialiser
hi: रीसेट
pt: Redefinir

# cuisineItalian
source: Italian
ar: إيطالي
es: Italiana
fr: Italienne
hi: इतालवी
pt: Italiana

# cuisineMexican
source: Mexican
ar: مكسيكي
es: Mexicana
fr: Mexicaine
hi: मैक्सिकन
pt: Mexicana

# cuisineAsian
source: Asian
ar: آسيوي
es: Asiática
fr: Asiatique
hi: एशियाई
pt: Asiática

# cuisineMediterranean
source: Mediterranean
ar: متوسطي
es: Mediterránea
fr: Méditerranéenne
hi: भूमध्यसागरीय
pt: Mediterrânea

# cuisineAmerican
source: American
ar: أمريكي
es: Americana
fr: Américaine
hi: अमेरिकी
pt: Americana

# cuisineFrench
source: French
ar: فرنسي
es: Francesa
fr: Française
hi: फ्रेंच
pt: Francesa

# cuisineIndian
source: Indian
ar: هندي
es: India
fr: Indienne
hi: भारतीय
pt: Indiana

# cuisineMiddleEastern
source: Middle Eastern
ar: شرق أوسطي
es: Oriente Medio
fr: Moyen-Orient
hi: मध्य पूर्वी
pt: Oriente Médio

# skillBeginner
source: Beginner
ar: مبتدأ
es: Principiante
fr: Débutant
hi: शुरुआती
pt: Iniciante

# skillIntermediate
source: Intermediate
ar: متوسط
es: Intermedio
fr: Intermédiaire
hi: मध्यवर्ती
pt: Intermediário

# skillPro
source: Pro
ar: محترف
es: Profesional
hi: पेशेवर
pt: Profissional

# allergenTreeNuts
source: Tree Nuts
ar: مكسرات
es: Frutos Secos
fr: Fruits à coque
hi: ट्री नट्स
pt: Nozes

# allergenPeanuts
source: Peanuts
ar: فول سوداني
es: Cacahuetes
fr: Arachides
hi: मूंगफली
pt: Amendoim

# allergenFish
source: Fish
ar: سمك
es: Pescado
fr: Poisson
hi: मछली
pt: Peixe

# allergenEggs
source: Eggs
ar: بيض
es: Huevos
fr: Œufs
hi: अंडे
pt: Ovos

# allergenMilk
source: Milk
ar: حليب
es: Leche
fr: Lait
hi: दूध
pt: Leite

# allergenShellfish
source: Shellfish
ar: محار
es: Mariscos
fr: Crustacés
hi: शेलफिश
pt: Mariscos

# allergenWheat
source: Wheat
ar: قمح
es: Trigo
fr: Blé
hi: गेहूं
pt: Trigo

# allergenSoy
source: Soy
ar: صويا
es: Soja
fr: Soja
hi: सोया
pt: Soja

# allergenSesame
source: Sesame
ar: سمسم
es: Sésamo
fr: Sésame
hi: तिल
pt: Gergelim

# allergenBig9
source: "Big 9"
ar: "التسع الكبار"
hi: "बिग 9"

# dietaryNext
source: Next
ar: التالي
es: Siguiente
fr: Suivant
hi: अगला
pt: Próximo

# dietaryFinish
source: Finish & Save
ar: إنهاء وحفظ
es: Terminar y Guardar
fr: Terminer & Enregistrer
hi: समाप्त करें और सहेजें
pt: Finalizar e Salvar

# dietaryFoodAllergiesTitle
source: Food Allergies
ar: حساسية الطعام
es: Alergias Alimentarias
fr: Allergies Alimentaires
hi: खाद्य एलर्जी
pt: Alergias Alimentares

# dietaryFoodAllergiesSubtitle
source: Select any immune-system exclusions (The "Big 9").
ar: حدد أي استثناءات مناعية (التسع الكبار).
es: Selecciona exclusiones inmunitarias (El "Big 9").
fr: Sélectionnez les exclusions immunitaires (Le "Big 9").
hi: प्रतिरक्षा प्रणाली बहिष्करण चुनें।
pt: Selecione exclusões imunológicas (O "Big 9").

# dietaryIntolerancesTitle
source: Intolerances
ar: عدم التحمل
es: Intolerancias
fr: Intolérances
hi: असहिष्णुता
pt: Intolerâncias

# dietaryIntolerancesSubtitle
source: Digestive sensitivities to avoid.
ar: حساسيات هضمية لتجنبها.
es: Sensibilidades digestivas a evitar.
fr: Sensibilités digestives à éviter.
hi: पाचन संबंधी संवेदनशीलता से बचें।
pt: Sensibilidades digestivas a evitar.

# dietaryLifestyleTitle
source: Lifestyle & Beliefs
ar: نمط الحياة والمعتقدات
es: Estilo de Vida y Creencias
fr: Mode de Vie & Croyances
hi: जीवन शैली और विश्वास
pt: Estilo de Vida e Crenças

# dietaryLifestyleSubtitle
source: Choices based on ethics, religion, or preference.
ar: خيارات تعتمد على الأخلاق، الدين، أو التفضيل.
es: Elecciones éticas, religiosas o preferencias.
fr: Choix basés sur l'éthique, la religion ou la préférence.
hi: नैतिकता, धर्म या पसंद पर आधारित विकल्प।
pt: Escolhas baseadas em ética, religião ou preferência.

# dietaryHealthGoalsTitle
source: Health Goals
ar: أهداف صحية
es: Objetivos de Salud
fr: Objectifs Santé
hi: स्वास्थ्य लक्ष्य
pt: Objetivos de Saúde

# dietaryHealthGoalsSubtitle
source: Nutritional focuses for your meals.
ar: تركيز غذائي لوجباتك.
es: Enfoques nutricionales para tus comidas.
fr: Focus nutritionnels pour vos repas.
hi: अपने भोजन के लिए पोषण संबंधी फोकस।
pt: Focos nutricionais para suas refeições.

# dietaryLactose
source: Lactose Intolerant
ar: حساسية اللاكتوز
es: Intolerante a Lactosa
fr: Intolérant au Lactose
hi: लैक्टोज असहिष्णु
pt: Intolerante a Lactose

# dietaryGluten
source: Gluten Intolerant
ar: حساسية الجلوتين
es: Intolerante al Gluten
fr: Intolérant au Gluten
hi: ग्लूटेन असहिष्णु
pt: Intolerante a Glúten

# dietaryFructose
source: Fructose
ar: فركتوز
es: Fructosa
hi: फ्रुक्टोज
pt: Frutose

# dietaryHistamine
source: Histamine
ar: هستامين
es: Histamina
hi: हिस्टामाइन
pt: Histamina

# dietaryLowSodium
source: Low-Sodium
ar: قليل الصوديوم
es: Bajo en Sodio
fr: Faible en Sodium
hi: कम सोडियम
pt: Baixo Sódio

# dietaryDiabetic
source: Diabetic-Friendly
ar: صديق للسكري
es: Apto para Diabéticos
fr: Adapté aux Diabétiques
hi: मधुमेह के अनुकूल
pt: Adequado para Diabéticos

# householdShareCode
source: Share this code or QR with your partner
ar: شارك هذا الرمز مع شريكك
es: Comparte este código o QR con tu pareja
fr: Partagez ce code ou QR avec votre partenaire
hi: इस कोड या QR को अपने साथी के साथ साझा करें
pt: Compartilhe este código ou QR com seu parceiro

# householdLeaveConfirm
source: Leave Household?
ar: مغادرة الأسرة؟
es: ¿Abandonar el Hogar?
fr: Quitter le Foyer ?
hi: परिवार छोड़ें?
pt: Sair da Família?

# householdLeaveMessage
source: You will lose access to the shared cart and vault.
ar: ستفقد الوصول إلى السلة والخزنة المشتركة.
es: Perderás acceso al carrito y bóveda compartidos.
fr: Vous perdrez l'accès au panier partagé et au coffre.
hi: आप साझा कार्ट और वॉल्ट तक पहुंच खो देंगे।
pt: Você perderá acesso ao carrinho e cofre compartilhados.

# householdLeaveButton
source: Leave
ar: مغادرة
es: Abandonar
fr: Quitter
hi: छोड़ें
pt: Sair

# householdSyncKitchen
source: Sync your kitchen 🤝
ar: زامن مطبخك 🤝
es: Sincroniza tu cocina 🤝
fr: Synchronisez votre cuisine 🤝
hi: अपनी रसोई सिंक करें 🤝
pt: Sincronize sua cozinha 🤝

# householdSyncDescription
source: Create a household to share your Shopping Cart and Vault with family members.
ar: أنشئ منزلاً لمشاركة سلة التسوق والخزنة مع أفراد العائلة.
es: Crea un hogar para compartir Carrito y Bóveda con la familia.
fr: Créez un foyer pour partager votre Panier et Coffre avec les membres de la famille.
hi: परिवार के सदस्यों के साथ अपनी कार्ट और वॉल्ट साझा करने के लिए एक परिवार बनाएं।
pt: Crie uma família para compartilhar seu Carrinho e Cofre com membros da família.

# householdCreateNew
source: Create New Household
ar: إنشاء منزل جديد
es: Crear Nuevo Hogar
fr: Créer Nouveau Foyer
hi: नया परिवार बनाएं
pt: Criar Nova Família

# householdNameHint
source: Household Name (e.g. Smith Family)
ar: اسم المنزل (مثل عائلة أحمد)
es: Nombre (ej: Familia García)
fr: Nom du Foyer (ex: Famille Dupont)
hi: परिवार का नाम (उदा. शर्मा परिवार)
pt: Nome da Família (ex: Família Silva)

# householdOr
source: OR
ar: أو
es: O
fr: OU
hi: या
pt: OU

# householdJoinExisting
source: Join Existing Household
ar: انضمام إلى منزل موجود
es: Unirse a Hogar Existente
fr: Rejoindre Foyer Existant
hi: मौजूदा परिवार में शामिल हों
pt: Entrar em Família Existente

# householdEnterCode
source: Enter Household Code
ar: أدخل رمز المنزل
es: Introducir Código
fr: Entrer Code Foyer
hi: परिवार कोड दर्ज करें
pt: Digitar Código da Família

# householdScanQR
source: Scan QR Code
ar: مسح رمز QR
es: Escanear QR
fr: Scanner Code QR
hi: QR कोड स्कैन करें
pt: Escanear Código QR

# householdExecutiveRequired
source: Executive Chef required to create a household.
ar: يتطلب اشتراك الشيف التنفيذي لإنشاء منزل.
es: Se requiere Chef Ejecutivo para crear hogar.
fr: Chef Exécutif requis pour créer un foyer.
hi: परिवार बनाने के लिए एग्जीक्यूटिव शेफ की आवश्यकता है।
pt: Chef Executivo necessário para criar família.

# householdEnterName
source: Please enter a name
ar: يرجى إدخال اسم
es: Por favor introduce un nombre
fr: Veuillez entrer un nom
hi: कृपया एक नाम दर्ज करें
pt: Por favor, digite um nome

# householdSomethingWrong
source: Something went wrong
ar: حدث خطأ ما
es: Algo salió mal
fr: Quelque chose s'est mal passé
hi: कुछ गलत हो गया
pt: Algo deu errado

# householdSessionExpired
source: Your session has expired. Please restart the app or sign out.
ar: انتهت جلستك. يرجى إعادة تشغيل التطبيق أو تسجيل الخروج.
es: Tu sesión ha expirado. Reinicia o cierra sesión.
fr: Votre session a expiré. Veuillez redémarrer l'appli ou vous déconnecter.
hi: आपका सत्र समाप्त हो गया है। कृपया ऐप को पुनः आरंभ करें या साइन आउट करें।
pt: Sua sessão expirou. Reinicie o app ou saia.

# errorSessionExpired
source: Session from session_id claim in JWT does not exist
es: La sesión del ID de sesión no existe
fr: La session issue de l'ID session n'existe pas
hi: JWT में सत्र ID मौजूद नहीं है
pt: Sessão do ID de sessão não existe

# errorSessionInvalid
source: Your session is invalid. Please sign out and log in again.
ar: جلستك غير صالحة. يرجى تسجيل الخروج وتسجيل الدخول مرة أخرى.
es: Tu sesión es inválida. Cierra e inicia sesión de nuevo.
fr: Votre session est invalide. Veuillez vous déconnecter et vous reconnecter.
hi: आपका सत्र अमान्य है। कृपया साइन आउट करें और फिर से लॉग इन करें।
pt: Sua sessão é inválida. Saia e entre novamente.

# settingsHelpSupport
source: Help & Support
ar: المساعدة والدعم
es: Ayuda y Soporte
fr: Aide & Support
hi: मदद और सहायता
pt: Ajuda e Suporte

# settingsMasterGuide
source: Master Instruction Guide
ar: دليل الإرشادات الرئيسي
es: Guía Maestra
fr: Guide d'Instruction Maître
hi: मास्टर गाइड
pt: Guia Mestre de Instruções

# guideTitle
source: Master Guide
ar: الدليل الرئيسي
es: Guía Maestra
fr: Guide Maître
hi: मास्टर गाइड
pt: Guia Mestre

# guideQuickStart
source: Quick Start
ar: بداية سريعة
es: Inicio Rápido
fr: Démarrage Rapide
hi: त्वरित आरंभ
pt: Início Rápido

# guideQuickStartDesc
source: Your First Recipe
ar: وصفتك الأولى
es: Tu Primera Receta
fr: Votre Première Recette
hi: आपकी पहली रेसिपी
pt: Sua Primeira Receita

# guideVault
source: The Vault
ar: الخزنة
es: La Bóveda
fr: Le Coffre
hi: द वॉल्ट
pt: O Cofre

# guideVaultDesc
source: Managing Your Cookbook
ar: إدارة كتاب الطبخ
es: Gestionando tu Libro de Cocina
fr: Gérer votre Livre de Cuisine
hi: अपनी कुकबुक का प्रबंधन
pt: Gerenciando seu Livro de Receitas

# guidePantryCart
source: Pantry & Cart
ar: المخزن والسلة
es: Despensa y Carrito
fr: Garde-manger & Panier
hi: पेंट्री और कार्ट
pt: Despensa e Carrinho

# guidePantryCartDesc
source: Smart Shopping
ar: تسوق ذكي
es: Compras Inteligentes
fr: Courses Intelligentes
hi: स्मार्ट खरीदारी
pt: Compras Inteligentes

# guideFamilySync
source: Family Sync
ar: مزامنة العائلة
es: Sincronización Familiar
fr: Sync Familiale
hi: पारिवारिक सिंक
pt: Sincronização Familiar

# guideFamilySyncDesc
source: Collaboration (Executive Only)
ar: التعاون (للشيف التنفيذي فقط)
es: Colaboración (Ejecutivo)
fr: Collaboration (Exécutif)
hi: सहयोग (एग्जीक्यूटिव)
pt: Colaboração (Executivo)

# guideOpenDiscover
source: Open Discover
ar: افتح الاكتشاف
es: Abrir Descubrir
fr: Ouvrir Découvrir
hi: डिस्कवर खोलें
pt: Abrir Descobrir

# guideOpenDiscoverDesc
source: Tap the compass icon to start your culinary journey.
ar: اضغط على أيقونة البوصلة لبدء رحلتك في الطهي.
es: Toca el icono de brújula para empezar.
fr: Appuyez sur l'icône boussole pour commencer.
hi: शुरू करने के लिए कम्पास आइकन पर टैप करें।
pt: Toque no ícone da bússola para começar.

# guideEnterPrompt
source: Enter Prompt
ar: أدخل الطلب
es: Introducir Prompt
fr: Entrer Prompt
hi: प्रॉम्प्ट दर्ज करें
pt: Digitar Prompt
