Repository: rawadaridi96/ChefMindAI
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fr, hi, pt

# authTermsAgree
source: By continuing, you agree to our
ar: بالمتابعة، أنت توافق على
es: Al continuar, aceptas nuestros
fr: En continuant, vous acceptez nos
hi: जारी रखकर, आप सहमत हैं
pt: Ao continuar, você concorda com nossos

# authTermsOfService
source: Terms of Service
ar: شروط الخدمة
es: Términos de Servicio
fr: Conditions d'Utilisation
hi: सेवा की शर्तें
pt: Termos de Serviço

# authAnd
source: and
ar: و
es: y
fr: et
hi: और
pt: e

# authPrivacyPolicy
source: Privacy Policy
ar: سياسة الخصوصية
es: Política de Privacidad
fr: Politique de Confidentialité
hi: गोपनीयता नीति
pt: Política de Privacidade

# authWelcomeBack
source: Welcome back, {name}!
ar: مرحباً بعودتك، {name}!
es: ¡Bienvenido de nuevo, {name}!
fr: Bon retour, {name}
hi: वापसी पर स्वागत है, {name}
pt: Bem-vindo de volta, {name}

# authAccountCreated
source: Account created successfully! Welcome to ChefMindAI.
ar: تم إنشاء الحساب بنجاح! مرحباً بك في ChefMindAI.
es: Cuenta creada con éxito
fr: Compte créé avec succès
hi: खाता सफलतापूर्वक बनाया गया
pt: Conta criada com sucesso

# authInvalidEmail
source: Invalid email address
ar: البريد الإلكتروني غير صالح
es: Dirección de correo inválida
fr: Adresse email invalide
hi: अमान्य ईमेल पता
pt: Endereço de email inválido

# authWeakPassword
source: Password is too weak
ar: كلمة المرور ضعيفة جداً
es: La contraseña es muy débil
fr: Le mot de passe est trop faible
hi: पासवर्ड बहुत कमजोर है
pt: A senha é muito fraca

# authEmailInUse
source: Email already in use
ar: البريد الإلكتروني مستخدم بالفعل
es: Correo ya en uso
fr: Email déjà utilisé
hi: ईमेल पहले से उपयोग में है
pt: Email já em uso

# authInvalidCredentials
source: Invalid email or password
ar: البريد أو كلمة المرور غير صحيحة
es: Correo o contraseña inválidos
fr: Email ou mot de passe invalide
hi: अमान्य ईमेल या पासवर्ड
pt: Email ou senha inválidos

# scannerTitle
source: Scan Ingredients
ar: مسح المكونات
es: Escanear Ingredientes
fr: Scanner les Ingrédients
hi: सामग्री स्कैन करें
pt: Escanear Ingredientes

# scannerTapToScan
source: Tap to scan
ar: اضغط للمسح
es: Toca para escanear
fr: Appuyez pour scanner
hi: स्कैन करने के लिए टैप करें
pt: Toque para escanear

# scannerAnalyzing
source: Analyzing...
ar: جاري التحليل...
es: Analizando...
fr: Analyse en cours...
hi: विश्लेषण हो रहा है...
pt: Analisando...

# scannerDetectedItems
source: Detected Items
ar: العناصر المكتشفة
es: Artículos Detectados
fr: Articles Détectés
hi: पहचाने गए आइटम
pt: Itens Detectados

# scannerAddAll
source: Add All
ar: إضافة الكل
es: Añadir Todo
fr: Tout Ajouter
hi: सब जोड़ें
pt: Adicionar Todos

# scannerAddSelected
source: Add Selected
ar: إضافة المحدد
es: Añadir Seleccionados
fr: Ajouter la Sélection
hi: चुने हुए जोड़ें
pt: Adicionar Selecionados

# scannerNoItemsFound
source: No items detected
ar: لم يتم اكتشاف عناصر
es: No se detectaron artículos
fr: Aucun article détecté
hi: कोई आइटम नहीं मिला
pt: Nenhum item detectado

# scannerTryAgain
source: Try again with better lighting
ar: حاول مرة أخرى مع إضاءة أفضل
es: Intenta de nuevo con mejor iluminación
fr: Réessayez avec un meilleur éclairage
hi: बेहतर रोशनी में फिर से कोशिश करें
pt: Tente novamente com melhor iluminação

# scannerFromGallery
source: From Gallery
ar: من المعرض
es: Desde Galería
fr: Depuis la Galerie
hi: गैलरी से
pt: Da Galeria

# householdTitle
source: Household
ar: العائلة
es: Hogar
fr: Foyer
hi: परिवार
pt: Família

# householdCreate
source: Create Household
ar: إنشاء عائلة
es: Crear Hogar
fr: Créer un Foyer
hi: परिवार बनाएं
pt: Criar Família

# householdJoin
source: Join Household
ar: الانضمام لعائلة
es: Unirse a Hogar
fr: Rejoindre un Foyer
hi: परिवार में शामिल हों
pt: Entrar em Família

# householdLeave
source: Leave Household
ar: مغادرة العائلة
es: Abandonar Hogar
fr: Quitter le Foyer
hi: परिवार छोड़ें
pt: Sair da Família

# householdMembers
source: Members
ar: الأعضاء
es: Miembros
fr: Membres
hi: सदस्य
pt: Membros

# householdInvite
source: Invite Members
ar: دعوة أعضاء
es: Invitar Miembros
fr: Inviter des Membres
hi: सदस्य आमंत्रित करें
pt: Convidar Membros

# householdInviteCode
source: Invite Code
ar: رمز الدعوة
es: Código de Invitación
fr: Code d'Invitation
hi: आमंत्रण कोड
pt: Código de Convite

# householdScanCode
source: Scan Code
ar: مسح الرمز
es: Escanear Código
fr: Scanner le Code
hi: कोड स्कैन करें
pt: Escanear Código

# householdShareVault
source: Share Recipe Vault
ar: مشاركة خزنة الوصفات
es: Compartir Bóveda de Recetas
fr: Partager le Coffre de Recettes
hi: रेसिपी वॉल्ट साझा करें
pt: Compartilhar Cofre

# householdNoHousehold
source: No household yet
ar: لا توجد عائلة بعد
es: Aún sin hogar
fr: Pas encore de foyer
hi: अभी कोई परिवार नहीं
pt: Sem família ainda

# householdCreateOrJoin
source: Create or join a household to share recipes
ar: أنشئ أو انضم لعائلة لمشاركة الوصفات
es: Crea o únete a un hogar para compartir recetas
fr: Créez ou rejoignez un foyer pour partager des recettes
hi: रेसिपी साझा करने के लिए परिवार बनाएं या शामिल हों
pt: Crie ou entre em uma família para compartilhar receitas

# errorGeneric
source: Something went wrong
ar: حدث خطأ ما
es: Algo salió mal
fr: Une erreur s'est produite
hi: कुछ गलत हो गया
pt: Algo deu errado

# errorNoConnection
source: No internet connection
ar: لا يوجد اتصال بالإنترنت
es: Sin conexión a internet
fr: Pas de connexion internet
hi: इंटरनेट कनेक्शन नहीं है
pt: Sem conexão com a internet

# errorTryAgain
source: Try Again
ar: حاول مرة أخرى
es: Intentar de Nuevo
fr: Réessayer
hi: फिर से कोशिश करें
pt: Tentar Novamente

# errorTimeout
source: Request timed out
ar: انتهت مهلة الطلب
es: Tiempo de espera agotado
fr: Délai d'attente dépassé
hi: अनुरोध समय समाप्त
pt: Tempo limite excedido

# errorServerError
source: Server error. Please try again later.
ar: خطأ في الخادم. يرجى المحاولة لاحقاً.
es: Error del servidor. Inténtalo más tarde.
fr: Erreur serveur. Veuillez réessayer plus tard.
hi: सर्वर त्रुटि। कृपया बाद में पुनः प्रयास करें।
pt: Erro no servidor. Tente novamente mais tarde.

# generalSave
source: Save
ar: حفظ
es: Guardar
fr: Enregistrer
hi: सहेजें
pt: Salvar

# generalCancel
source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
hi: रद्द करें
pt: Cancelar

# generalDelete
source: Delete
ar: حذف
es: Eliminar
fr: Supprimer
hi: हटाएं
pt: Excluir

# generalEdit
source: Edit
ar: تعديل
es: Editar
fr: Modifier
hi: संपादित करें
pt: Editar

# generalDone
source: Done
ar: تم
es: Hecho
fr: Terminé
hi: हो गया
pt: Concluído

# generalClose
source: Close
ar: إغلاق
es: Cerrar
fr: Fermer
hi: बंद करें
pt: Fechar

# generalConfirm
source: Confirm
ar: تأكيد
es: Confirmar
fr: Confirmer
hi: पुष्टि करें
pt: Confirmar

# generalYes
source: Yes
ar: نعم
es: Sí
fr: Oui
hi: हां
pt: Sim

# generalNo
source: No
ar: لا
fr: Non
hi: नहीं
pt: Não

# generalOk
source: OK
ar: حسناً
hi: ठीक है

# generalLoading
source: Loading...
ar: جاري التحميل...
es: Cargando...
fr: Chargement...
hi: लोड हो रहा है...
pt: Carregando...

# generalSearch
source: Search
ar: بحث
es: Buscar
fr: Rechercher
hi: खोजें
pt: Buscar

# generalRefresh
source: Refresh
ar: تحديث
es: Actualizar
fr: Actualiser
hi: रीफ्रेश करें
pt: Atualizar

# generalShare
source: Share
ar: مشاركة
es: Compartir
fr: Partager
hi: शेयर करें
pt: Compartilhar

# generalCopy
source: Copy
ar: نسخ
es: Copiar
fr: Copier
hi: कॉपी करें
pt: Copiar

# generalCopied
source: Copied!
ar: تم النسخ!
es: ¡Copiado!
fr: Copié !
hi: कॉपी हो गया!
pt: Copiado!

# dietaryVegetarian
source: Vegetarian
ar: نباتي
es: Vegetariano
fr: Végétarien
hi: शाकाहारी
pt: Vegetariano

# dietaryVegan
source: Vegan
ar: نباتي صرف
es: Vegano
fr: Végan
hi: वीगन
pt: Vegano

# dietaryHalal
source: Halal
ar: حلال
hi: हलाल

# dietaryKosher
source: Kosher
ar: كوشر
fr: Casher
hi: कोशर

# dietaryKeto
source: Keto
ar: كيتو
hi: कीटो

# dietaryPaleo
source: Paleo
ar: باليو
fr: Paléo
hi: पैलियो

# dietaryLowCarb
source: Low-Carb
ar: قليل الكربوهيدرات
es: Bajo en Carbohidratos
fr: Faible en Glucides
hi: कम कार्ब
pt: Baixo Carboidrato

# dietaryLowFat
source: Low Fat
ar: قليل الدهون
es: Bajo en Grasa
fr: Faible en Gras
hi: कम वसा
pt: Baixa Gordura

# dietaryHighProtein
source: High Protein
ar: غني بالبروتين
es: Alto en Proteína
fr: Riche en Protéines
hi: उच्च प्रोटीن
pt: Alta Proteína

# unitGrams
source: g
ar: غ
hi: ग्राम

# unitKilograms
source: kg
ar: كغ
hi: किलो

# unitMilliliters
source: ml
ar: مل
hi: मिली

# unitLiters
source: L
ar: ل
hi: लीटर

# unitCups
source: cups
ar: كوب
es: tazas
fr: tasses
hi: कप
pt: xícaras

# unitTablespoons
source: tbsp
ar: ملعقة ك
es: cda
fr: c. à s.
hi: बड़ा चम्मच
pt: colheres

# unitTeaspoons
source: tsp
ar: ملعقة ص
es: cdta
fr: c. à c.
hi: छोटा चम्मच
pt: colherinhas

# unitPieces
source: pcs
ar: قطعة
es: pzs
hi: टुकड़े
pt: unidades

# unitMinutes
source: min
ar: دقيقة
hi: मिनट

# languageSelectTitle
source: Select Language
ar: اختر اللغة
es: Seleccionar Idioma
fr: Sélectionner la Langue
hi: भाषा चुनें
pt: Selecionar Idioma

source: Premium Feature
ar: ميزة مميزة
es: Función Premium
fr: Fonctionnalité Premium
hi: प्रीमियम सुविधा
pt: Recurso Premium

# premiumUnlock
source: Unlock with Sous Chef+
ar: افتح مع مساعد شيف+
es: Desbloquear con Sous Chef+
fr: Débloquer avec Sous Chef+
hi: सू शेफ+ के साथ अनलॉक करें
pt: Desbloqueie com Sous Chef+

# premiumUpgradeNow
source: Upgrade Now
ar: ترقية الآن
es: Mejorar Ahora
fr: Passer au Supérieur
hi: अभी अपग्रेड करें
pt: Atualizar Agora

# premiumLimitReached
source: Limit Reached
ar: تم الوصول للحد
es: Límite Alcanzado
fr: Limite atteinte
hi: सीमा समाप्त
pt: Limite Atingido

# premiumNotNow
source: Not now
ar: ليس الآن
es: Ahora no
fr: Pas maintenant
hi: अभी नहीं
pt: Agora não

# premiumUpgradeToSous
source: Upgrade to Sous Chef
ar: ترقية إلى شيف مساعد
es: Mejorar a Sous Chef
fr: Passer à Sous Chef
hi: सू शेफ में अपग्रेड करें
pt: Atualizar para Sous Chef

# premiumUpgradeToExecutive
source: Upgrade to Executive Chef
ar: ترقية إلى شيف تنفيذي
es: Mejorar a Chef Ejecutivo
fr: Passer à Chef Exécutif
hi: एग्जीक्यूटिव शेफ में अपग्रेड करें
pt: Atualizar para Chef Executivo

# premiumUpgradeToSousOrExecutive
source: Upgrade to Sous or Executive Chef
ar: ترقية إلى شيف مساعد أو تنفيذي
es: Mejorar a Sous o Chef Ejecutivo
fr: Passer à Sous Chef ou Chef Exécutif
hi: सू या एग्जीक्यूटिव शेफ में अपग्रेड करें
pt: Atualizar para Sous ou Chef Executivo

# premiumVaultFull
source: Vault is full. Upgrade to save more!
ar: الخزنة ممتلئة. قم بالترقية لحفظ المزيد!
es: La bóveda está llena. ¡Mejora para guardar más!
fr: Le coffre est plein. Mettez à niveau pour en sauvegarder plus !
hi: वॉल्ट भरा हुआ है। और सहेजने के लिए अपग्रेड करें!
pt: O cofre está cheio. Atualize para salvar mais!

# premiumDailyShareLimit
source: Daily share limit reached (5/5). Upgrade for unlimited sharing!
ar: تم الوصول للحد اليومي للمشاركة (5/5). قم بالترقية لمشاركة غير محدودة!
es: Límite diario de compartir alcanzado (5/5). ¡Mejora para compartir ilimitado!
fr: Limite de partage quotidienne atteinte (5/5). Mettez à niveau pour un partage illimité !
hi: दैनिक शेयर सीमा पूरी (5/5)। असीमित शेयरिंग के लिए अपग्रेड करें!
pt: Limite diário de compartilhamento atingido (5/5). Atualize para compartilhamento ilimitado!

# premiumMoodExecutive
source: Mood-based suggestions require an Executive Chef plan.
ar: الاقتراحات حسب المزاج تتطلب خطة شيف تنفيذي.
es: Las sugerencias basadas en el estado de ánimo requieren un plan Chef Ejecutivo.
fr: Les suggestions basées sur l'humeur nécessitent un plan Chef Exécutif.
hi: मूड-आधारित सुझावों के लिए एग्जीक्यूटिव शेफ योजना की आवश्यकता है।
pt: Sugestões baseadas no humor requerem plano Chef Executivo.

# premiumADISous
source: Advanced Dietary Intelligence requires a Sous Chef plan.
ar: الذكاء الغذائي المتقدم يتطلب خطة شيف مساعد.
es: La Inteligencia Dietética Avanzada requiere un plan Sous Chef.
fr: L'intelligence diététique avancée nécessite un plan Sous Chef.
hi: उन्नत आहार बुद्धिमत्ता के लिए सू शेफ योजना की आवश्यकता है।
pt: Inteligência Alimentar Avançada requer plano Sous Chef.

# premiumFeatureADI
source: Advanced Dietary Intelligence
ar: الذكاء الغذائي المتقدم
es: Inteligencia Dietética Avanzada
fr: Intelligence Diététique Avancée
hi: उन्नत आहार बुद्धिमत्ता
pt: Inteligência Alimentar Avançada

# premiumDailyRecipeLimit
source: You've reached your daily limit of {limit} recipes.
ar: لقد وصلت إلى حدك اليومي البالغ {limit} وصفات.
es: Has alcanzado tu límite diario de {limit} recetas.
fr: Vous avez atteint votre limite quotidienne de {limit} recettes.
hi: आप अपनी {limit} रेसिपी की दैनिक सीमा तक पहुँच चुके हैं।
pt: Você atingiu seu limite diário de {limit} receitas.

# premiumLinkScraper
source: Link Scraper is a Sous Chef feature.
ar: استيراد الروابط هو ميزة للشيف المساعد.
es: El Importador de Enlaces es una función de Sous Chef.
fr: L'importation de liens est une fonctionnalité Sous Chef.
hi: लिंक आयातक एक सू शेफ सुविधा है।
pt: Importador de Links é um recurso Sous Chef.

source: Recipe Locked
ar: الوصفة مقفلة
es: Receta Bloqueada
fr: Recette Verrouillée
hi: रेसिपी लॉक
pt: Receita Bloqueada

# recipeUnlock
source: Unlock Full Recipe
ar: فتح الوصفة الكاملة
es: Desbloquear Receta Completa
fr: Débloquer la Recette Complète
hi: पूरी रेसिपी अनलॉक करें
pt: Desbloquear Receita Completa

# recipeUnlockTitle
source: Unlock the Full Recipe
ar: فتح الوصفة الكاملة
es: Desbloquear la Receta Completa
fr: Débloquer la Recette Complète
hi: पूरी रेसिपी अनलॉक करें
pt: Desbloquear a Receita Completa

# recipeGuestLimit
source: You've reached your guest limit. Sign up for free to unlock this recipe and keep cooking!
ar: لقد وصلت إلى حد الزوار. سجل مجاناً لفتح هذه الوصفة ومتابعة الطبخ!
es: Has alcanzado tu límite de invitado. ¡Regístrate gratis para desbloquear esta receta y seguir cocinando!
fr: Vous avez atteint la limite invité. Inscrivez-vous gratuitement pour débloquer cette recette et continuer à cuisiner !
hi: आप अपनी अतिथि सीमा तक पहुँच चुके हैं। इस रेसिपी को अनलॉक करने और खाना पकाने के लिए मुफ्त में साइन अप करें!
pt: Você atingiu seu limite de visitante. Cadastre-se grátis para desbloquear esta receita e continuar cozinhando!

# authSignUpFree
source: Sign Up for Free
ar: تسجيل مجاني
es: Regístrate Gratis
fr: Inscription Gratuite
hi: मुफ्त साइन अप
pt: Cadastre-se Grátis

# authHaveAccount
source: Already have an account? Log In
ar: لديك حساب بالفعل؟ تسجيل الدخول
es: ¿Ya tienes una cuenta? Inicia Sesión
fr: Déjà un compte ? Connectez-vous
hi: पहले से खाता है? लॉग इन करें
pt: Já tem conta? Entre

# vaultDeleteTitle
source: Delete Recipe?
ar: حذف الوصفة؟
es: ¿Eliminar Receta?
fr: Supprimer la Recette ?
hi: रेसिपी हटाएं?
pt: Excluir Receita?

# vaultDeleteContent
source: Are you sure you want to remove this from your Vault?
ar: هل أنت متأكد من إزالة هذه الوصفة من الخزنة؟
es: ¿Estás seguro de que quieres eliminar esto de tu Bóveda?
fr: Êtes-vous sûr de vouloir retirer ceci de votre Coffre ?
hi: क्या आप वाकई इसे अपने वॉल्ट से हटाना चाहते हैं?
pt: Tem certeza que deseja remover isso do seu Cofre?

# vaultRemovedToast
source: Recipe removed from Vault
ar: تم إزالة الوصفة من الخزنة
es: Receta eliminada de la Bóveda
fr: Recette retirée du Coffre
hi: रेसिपी वॉल्ट से हटा दी गई
pt: Receita removida do Cofre

# recipeSaved
source: Recipe saved to Vault!
ar: تم حفظ الوصفة في الخزنة!
es: Receta Guardada
fr: Recette Enregistrée
hi: रेसिपी सहेजी गई
pt: Receita Salva

# recipeOriginal
source: Original
ar: الأصلية
hi: मूल

# recipeMyVersion
source: My Version
ar: نسختي
es: Mi Versión
fr: Ma Version
hi: मेरा संस्करण
pt: Minha Versão

# recipeEquipment
source: Equipment Needed
ar: المعدات المطلوبة
es: Equipo
fr: Équipement
hi: उपकरण
pt: Equipamento

# recipeIngredients
source: Ingredients
ar: المكونات
es: Ingredientes
fr: Ingrédients
hi: सामग्री
pt: Ingredientes

# actionDelete
source: Delete
ar: حذف
es: Eliminar
fr: Supprimer
hi: हटाएं
pt: Excluir

# vaultJoinHousehold
source: Join a household in Settings to sync.
ar: انضم إلى منزل في الإعدادات للمزامنة.
es: Únete a un hogar en Configuración para sincronizar.
fr: Rejoignez un foyer dans les Paramètres pour synchroniser.
hi: सिंक करने के लिए सेटिंग्स में परिवार में शामिल हों।
pt: Entre em uma família nas Configurações para sincronizar.

# vaultViewingHousehold
source: Viewing Household Vault
ar: عرض خزنة المنزل
es: Viendo Bóveda del Hogar
fr: Affichage du Coffre Familial
hi: परिवार वॉल्ट देख रहे हैं
pt: Visualizando Cofre da Família

# vaultViewingPersonal
source: Viewing Personal Vault
ar: عرض الخزنة الشخصية
es: Viendo Bóveda Personal
fr: Affichage du Coffre Personnel
hi: व्यक्तिगत वॉल्ट देख रहे हैं
pt: Visualizando Cofre Pessoal

# vaultNoLinks
source: No saved links yet.
ar: لا توجد روابط محفوظة بعد.
es: Aún no hay enlaces guardados.
fr: Pas encore de liens enregistrés.
hi: अभी कोई लिंक सहेजा नहीं गया।
pt: Nenhum link salvo ainda.

# vaultNoRecipes
source: No saved recipes yet.
ar: لا توجد وصفات محفوظة بعد.
es: Aún no hay recetas guardadas.
fr: Pas encore de recettes enregistrées.
hi: अभी कोई रेसिपी सहेजी नहीं गई।
pt: Nenhuma receita salva ainda.

# vaultDeleteConfirmTitle
source: Delete {item}?
ar: حذف {item}؟
es: ¿Eliminar {item}?
fr: Supprimer {item} ?
hi: {item} हटाएं?
pt: Excluir {item}?

# vaultDeleteConfirmMessage
source: Are you sure you want to delete this?
ar: هل أنت متأكد أنك تريد حذف هذا؟
es: ¿Estás seguro de que quieres eliminar esto?
fr: Êtes-vous sûr de vouloir supprimer ceci ?
hi: क्या आप वाकई इसे हटाना चाहते हैं?
pt: Tem certeza que deseja excluir isto?

# vaultDeleteConfirmAction
source: Delete
ar: حذف
es: Eliminar
fr: Supprimer
hi: हटाएं
pt: Excluir

# recipeInstructions
source: Instructions
ar: التعليمات
es: Instrucciones
hi: निर्देश
pt: Instruções

# recipeAddMissingToCart
source: Add Missing to Cart
ar: إضافة الناقص للسلة
es: Añadir Faltantes al Carrito
fr: Ajouter Manquants au Panier
hi: लापता कार्ट में जोड़ें
pt: Adicionar Faltantes ao Carrinho

# recipeAddedToCartCount
source: Added {count} items to Cart!
ar: تم إضافة {count} عناصر للسلة!
es: Añadidos {count} artículos al carrito
fr: {count} articles ajoutés au panier
hi: {count} आइटम कार्ट में जोड़े गए
pt: {count} itens adicionados ao carrinho

# recipeReadyForCheckout
source: Ready for checkout.
ar: جاهز للدفع.
es: Listo para pagar
fr: Prêt pour le paiement
hi: चेकआउट के लिए तैयार
pt: Pronto para finalizar

# recipeNoMissingIngredients
source: No missing ingredients to add.
ar: لا توجد مكونات ناقصة للإضافة.
es: No faltan ingredientes
fr: Aucun ingrédient manquant
hi: कोई लापता सामग्री नहीं
pt: Nenhum ingrediente faltando

# recipeStartCooking
source: Start Cooking Mode
ar: ابدأ وضع الطبخ
es: Empezar Modo Cocina
fr: Mode Cuisine
hi: कुकिंग मोड शुरू करें
pt: Modo Cozinhar

# recipeSaveIngredientsTitle
source: Save Ingredients To...
ar: حفظ المكونات في...
es: Guardar Ingredientes En...
fr: Sauvegarder Ingrédients Dans...
hi: सामग्री सहेजें...
pt: Salvar Ingredientes Em...

# cartPersonal
source: Personal Cart
ar: سلة شخصية
es: Carrito Personal
fr: Panier Personnel
hi: व्यक्तिगत कार्ट
pt: Carrinho Pessoal

# cartPersonalSubtitle
source: Only visible to you on this device
ar: مرئية لك فقط على هذا الجهاز
es: Solo visible para ti en este dispositivo
fr: Visible uniquement par vous sur cet appareil
hi: केवल इस डिवाइस पर आपको दिखाई देगा
pt: Visível apenas para você neste dispositivo

# cartHousehold
source: Household Cart
ar: سلة العائلة
es: Carrito Hogar
fr: Panier Foyer
hi: घरेलू कार्ट
pt: Carrinho Doméstico

# cartHouseholdSubtitle
source: Synced with all family members
ar: متزامنة مع جميع أفراد العائلة
es: Sincronizado con todos los miembros
fr: Synchronisé avec tous les membres
hi: सभी परिवार के सदस्यों के साथ सिंक किया गया
pt: Sincronizado com todos os membros

# cartSavedToHousehold
source: Saved to Household Cart
ar: تم الحفظ في سلة العائلة
es: Guardado en Carrito Hogar
fr: Enregistré dans Panier Foyer
hi: घरेलू कार्ट में सहेजा गया
pt: Salvo no Carrinho Doméstico

# authBiometricFailed
source: Biometric Auth Failed: {error}
ar: فشلت المصادقة البيومترية: {error}
es: Fallo de Autenticación Biométrica: {error}
fr: Échec de l'Auth Biométrique : {error}
hi: बायोमेट्रिक प्रमाणीकरण विफल: {error}
pt: Falha na Autenticação Biométrica: {error}

# authEmailRequired
source: Email required
ar: البريد الإلكتروني مطلوب
es: Correo requerido
fr: Email requis
hi: ईमेल आवश्यक है
pt: Email necessário

# authPasswordResetSent
source: Password reset sent to
ar: تم إرسال إعادة تعيين كلمة المرور إلى
es: Restablecimiento de contraseña enviado a
fr: Réinitialisation du mot de passe envoyée à
hi: पासवर्ड रीसेट भेजा गया
pt: Redefinição de senha enviada para

# recipeUpdated
source: Recipe updated! Use the toggle to view original.
ar: تم تحديث الوصفة! استخدم التبديل لعرض الأصل.
es: Receta actualizada
fr: Recette mise à jour
hi: रेसिपी अपडेट की गई
pt: Receita atualizada

# recipeIngredientNotFound
source: Could not find ingredient to modify.
ar: لم يتم العثور على المكون للتعديل.
es: Ingrediente no encontrado
fr: Ingrédient non trouvé
hi: सामग्री नहीं मिली
pt: Ingrediente não encontrado

source: Recipe Unlocked!
ar: تم فتح الوصفة!
es: Receta Desbloqueada
fr: Recette Débloquée
hi: रेसिपी अनलॉक
pt: Receita Desbloqueada

# recipeSavedToVault
source: Recipe saved to your Vault!
ar: تم حفظ الوصفة في خزنتك!
es: Guardada en Bóveda
fr: Enregistré dans le Coffre
hi: वॉल्ट में सहेजा गया
pt: Salvo no Cofre

source: Share with Household
ar: مشاركة مع العائلة
es: Compartir con el Hogar
fr: Partager avec le Foyer
hi: परिवार के साथ साझा करें
pt: Compartilhar com a Família

# shareWithHouseholdSubtitle
source: Make visible to family members
ar: اجعلها مرئية لأفراد العائلة
es: Hacer visible para los miembros de la familia
fr: Rendre visible aux membres de la famille
hi: परिवार के सदस्यों को दृश्यमान बनाएं
pt: Tornar visível para membros da família

# shareAlreadyShared
source: Already shared with your household
ar: تمت مشاركتها بالفعل مع عائلتك
es: Ya compartido con tu hogar
fr: Déjà partagé avec votre foyer
hi: पहले से ही आपके परिवार के साथ साझा
pt: Já compartilhado com sua família

# shareJoinHouseholdError
source: Join a household in Settings to share.
ar: انضم لمنزل في الإعدادات للمشاركة.
es: Únete a un hogar en Configuración para compartir.
fr: Rejoignez un foyer dans les Paramètres pour partager.
hi: साझा करने के लिए सेटिंग्स में परिवार में शामिल हों।
pt: Entre em uma família nas Configurações para compartilhar.

# shareSharing
source: Sharing with household...
ar: جاري المشاركة مع العائلة...
es: Compartiendo con el hogar...
fr: Partage avec le foyer...
hi: परिवार के साथ साझा कर रहा है...
pt: Compartilhando com a família...

# shareSaving
source: Saving to household...
ar: جاري الحفظ للعائلة...
es: Guardando en el hogar...
fr: Enregistrement pour le foyer...
hi: परिवार के लिए सहेज रहा है...
pt: Salvando para a família...

# importSaving
source: Saving to Vault...
ar: جاري الحفظ للخزنة...
es: Guardando en la Bóveda...
fr: Enregistrement dans le Coffre...
hi: वॉल्ट में सहेज रहा है...
pt: Salvando no Cofre...

# importLinkSaved
source: Link Saved to Vault! 📂
ar: تم حفظ الرابط في الخزنة! 📂
es: ¡Enlace Guardado en la Bóveda! 📂
fr: Lien Enregistré dans le Coffre ! 📂
hi: लिंक वॉल्ट में सहेजा गया! 📂
pt: Link Salvo no Cofre! 📂

# importError
source: Error: {error}
ar: خطأ: {error}
fr: Erreur : {error}
hi: त्रुटि: {error}
pt: Erro: {error}

# sharedRecipeTitle
source: Shared Recipe
ar: وصفة مشتركة
es: Receta Compartida
fr: Recette Partagée
hi: साझा रेसिपी
pt: Receita Compartilhada

# sharedRecipeLoading
source: Loading Shared Recipe...
ar: جاري تحميل الوصفة المشتركة...
es: Cargando Receta Compartida...
fr: Chargement de la Recette Partagée...
hi: साझा रेसिपी लोड हो रही है...
pt: Carregando Receita Compartilhada...

# sharedRecipeNotFound
source: Recipe not found or expired.
ar: الوصفة غير موجودة أو انتهت صلاحيتها.
es: Receta no encontrada o expirada.
fr: Recette introuvable ou expirée.
hi: रेसिपी नहीं मिली या समाप्त हो गई।
pt: Receita não encontrada ou expirada.
