Repository: rawadaridi96/ChefMindAI
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fr, hi, pt

# guideEnterPromptDesc
source: Type a craving or use a "Recent Chip" to save time.
ar: اكتب رغبتك أو استخدم "شريحة حديثة" لتوفير الوقت.
es: Escribe un antojo o usa un chip reciente.
fr: Tapez une envie ou utilisez une puce récente.
hi: कुछ खाने की इच्छा टाइप करें या हाल के चिप का उपयोग करें।
pt: Digite um desejo ou use um chip recente.

# guideGenerateMagic
source: Generate Magic
ar: اصنع السحر
es: Generar Magia
fr: Générer Magie
hi: जादू उत्पन्न करें
pt: Gerar Magia

# guideGenerateMagicDesc
source: Tap "Generate" and watch the AI craft your meal.
ar: اضغط "إنشاء" وشاهد الذكاء الاصطناعي يصنع وجبتك.
es: Toca "Generar" y mira a la IA crear.
fr: Appuyez sur "Générer" et regardez l'IA créer.
hi: "उत्पन्न करें" पर टैप करें और AI को अपना भोजन बनाते देखें।
pt: Toque em "Gerar" e veja a IA criar sua refeição.

# guideGenerateMagicTip
source: Tip: Tap the "Magic Wand" to upgrade your simple prompt into a chef-level request.
ar: نصيحة: اضغط على "العصا السحرية" لترقية طلبك البسيط إلى طلب بمستوى الشيف.
es: Consejo: Usa la "Varita Mágica" para mejorar tu pedido.
fr: Astuce : Appuyez sur la "Baguette Magique" pour améliorer votre prompt.
hi: सुझाव: अपने सरल प्रॉम्प्ट को शेफ-स्तर के अनुरोध में अपग्रेड करने के लिए "जादू की छड़ी" पर टैप करें।
pt: Dica: Toque na "Varinha Mágica" para melhorar seu pedido.

# guideDigitalCookbook
source: Digital Cookbook
ar: كتاب الطبخ الرقمي
es: Libro de Cocina Digital
fr: Livre de Cuisine Numérique
hi: डिजिटल कुकबुक
pt: Livro de Receitas Digital

# guideDigitalCookbookDesc
source: The Vault is where all your saved masterpieces live.
ar: الخزنة هي المكان الذي تعيش فيه كل روائعك المحفوظة.
es: La Bóveda es donde viven tus obras maestras.
fr: Le Coffre est l'endroit où vivent vos chefs-d'œuvre.
hi: वॉल्ट वह जगह है जहां आपकी सभी कृतियाँ रहती हैं।
pt: O Cofre é onde vivem suas obras-primas.

# guideStorageLimits
source: Storage Limits
ar: حدود التخزين
es: Límites de Almacenamiento
fr: Limites de Stockage
hi: भंडारण सीमाएं
pt: Limites de Armazenamento

# guideStorageLimitsDesc
source: Home Cooks have a save limit. Sous Chefs get unlimited storage.
ar: الطهاة المنزليون لديهم حد للحفظ. الشيف المساعد يحصل على تخزين غير محدود.
es: Cocineros tienen límite. Sous Chefs ilimitado.
fr: Les Cuisiniers Maison ont une limite. Les Sous Chefs illimités.
hi: होम कुक की एक सहेजने की सीमा होती है। सू शेफ असीमित।
pt: Cozinheiros Caseiros têm limite. Sous Chefs ilimitado.

# guideSmartSearch
source: Smart Search
ar: بحث ذكي
es: Búsqueda Inteligente
fr: Recherche Intelligente
hi: स्मार्ट खोज
pt: Busca Inteligente

# guideSmartSearchDesc
source: Use the Search History icon inside the search bar to find past ideas instantly.
ar: استخدم أيقونة سجل البحث داخل شريط البحث للعثور على الأفكار السابقة فوراً.
es: Usa el historial para encontrar ideas pasadas.
fr: Utilisez l'historique de recherche pour retrouver des idées.
hi: पिछले विचारों को तुरंत खोजने के लिए खोज बार के अंदर खोज इतिहास आइकन का उपयोग करें।
pt: Use o histórico de busca para encontrar ideias passadas.

# guidePantryTracking
source: Pantry Tracking
ar: تتبع المخزن
es: Rastrear Despensa
fr: Suivi Garde-manger
hi: पेंट्री ट्रैकिंग
pt: Rastreio de Despensa

# guidePantryTrackingDesc
source: Keep track of what you have so you never buy doubles.
ar: تتبع ما لديك حتى لا تشتري مكررات.
es: Rastrea lo que tienes para no comprar doble.
fr: Suivez ce que vous avez pour ne pas acheter en double.
hi: जो आपके पास है उसका ट्रैक रखें ताकि आप कभी भी डबल न खरीदें।
pt: Rastreie o que você tem para não comprar dobrado.

# guideSmartCart
source: Smart Cart
ar: سلة ذكية
es: Carrito Inteligente
fr: Panier Intelligent
hi: स्मार्ट कार्ट
pt: Carrinho Inteligente

# guideSmartCartDesc
source: Missing salt? We add a full box, not just a teaspoon!
ar: ينقصك الملح؟ نضيف علبة كاملة، وليس ملعقة صغيرة فقط!
es: ¿Falta sal? ¡Añadimos el paquete entero!
fr: Manque de sel ? Nous ajoutons une boîte entière !
hi: नमक नहीं है? हम पूरा डिब्बा जोड़ते हैं, सिर्फ एक चम्मच नहीं!
pt: Faltando sal? Adicionamos a caixa toda, não só uma colher!

# guideEasyAdjustments
source: Easy Adjustments
ar: تعديلات سهلة
es: Ajustes Fáciles
fr: Ajustements Faciles
hi: आसान समायोजन
pt: Ajustes Fáceis

# guideEasyAdjustmentsDesc
source: Use the Quantity Stepper (+/-) to adjust amounts on the fly.
ar: استخدم متحكم الكمية (+/-) لضبط الكميات أثناء التنقل.
es: Usa (+/-) para ajustar cantidades.
fr: Utilisez le compteur (+/-) pour ajuster.
hi: मात्रा को फ्लाई पर समायोजित करने के लिए मात्रा स्टेपर (+/-) का उपयोग करें।
pt: Use o contador (+/-) para ajustar quantias.

# guideRealtimeShop
source: Real-time Shop
ar: تسوق فوري
es: Compra en Tiempo Real
fr: Courses Temps Réel
hi: रीयल-टाइम शॉप
pt: Compra em Tempo Real

# guideRealtimeShopDesc
source: Toggle "Family Sync" on the Cart to shop together in real-time.
ar: فعّل "مزامنة العائلة" على السلة للتسوق معاً في الوقت الفعلي.
es: Activa "Sync Familiar" para comprar juntos.
fr: Activez "Sync Familiale" pour faire les courses ensemble.
hi: रीयल-टाइम में एक साथ खरीदारी करने के लिए कार्ट पर "पारिवारिक सिंक" टॉगल करें।
pt: ative "Sync Familiar" no Carrinho para comprar juntos.

# guideShareRecipes
source: Share Recipes
ar: شارك الوصفات
es: Compartir Recetas
fr: Partager Recettes
hi: रेसिपी साझा करें
pt: Compartilhar Receitas

# guideShareRecipesDesc
source: "Publish" a recipe to the Shared Vault so everyone can see it.
ar: "انشر" وصفة في الخزنة المشتركة ليتمكن الجميع من رؤيتها.
es: "Publica" una receta en la Bóveda Compartida.
fr: "Publiez" une recette dans le Coffre Partagé.
hi: साझा वॉल्ट में एक रेसिपी "प्रकाशित" करें ताकि हर कोई इसे देख सके।
pt: "Publique" uma receita no Cofre Compartilhado.

# guideNext
source: Next
ar: التالي
es: Siguiente
fr: Suivant
hi: अगला
pt: Próximo

# shoppingToBuy
source: To Buy
ar: للشراء
es: Para Comprar
fr: À Acheter
hi: खरीदने के लिए
pt: Para Comprar

# shoppingClearDialogTitle
source: Clear Shopping List?
ar: مسح قائمة التسوق؟
es: ¿Borrar Lista de Compras?
fr: Effacer Liste Courses ?
hi: खरीदारी सूची साफ़ करें?
pt: Limpar Lista de Compras?

# shoppingClearDialogContent
source: This will remove all items from your cart. This action cannot be undone.
ar: سيتم إزالة جميع العناصر من السلة. لا يمكن التراجع عن هذا الإجراء.
es: Esto eliminará todos los artículos. No se puede deshacer.
fr: Ceci retirera tous les articles de votre panier. Indispensable.
hi: यह आपकी कार्ट से सभी आइटम हटा देगा। यह कार्रवाई पूर्ववत नहीं की जा सकती।
pt: Isso removerá todos os itens do carrinho. Não pode ser desfeito.

# shoppingClearDialogCancel
source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
hi: रद्द करें
pt: Cancelar

# shoppingClearDialogConfirm
source: Clear All
ar: مسح الكل
es: Borrar Todo
fr: Tout Effacer
hi: सब साफ़ करें
pt: Limpar Tudo

# authPasswordRequired
source: Password is required
es: La contraseña es obligatoria
fr: Le mot de passe est requis
hi: पासवर्ड आवश्यक है
pt: Senha é obrigatória

# authOrContinueWith
source: or continue with
ar: أو تابع باستخدام
es: o continuar con
fr: ou continuer avec
hi: या इसके साथ जारी रखें
pt: ou continue com

# authFullName
source: Full Name
ar: الاسم الكامل
es: Nombre Completo
fr: Nom Complet
hi: पूरा नाम
pt: Nome Completo

# authNoBiometricFound
source: No biometric credentials found
es: No se encontraron credenciales biométricas
fr: Aucun identifiant biométrique trouvé
hi: कोई बायोमेट्रिक क्रेडेंशियल नहीं मिला
pt: Nenhuma credencial biométrica encontrada

# authWelcomeGuest
source: Welcome, Guest Chef!
ar: مرحباً أيها الشيف الضيف!
es: ¡Bienvenido, Chef Invitado!
fr: Bienvenue, Chef Invité !
hi: स्वागत है, अतिथि शेफ!
pt: Bem-vindo, Chef Convidado!

# authSignedInGoogle
source: Signed in with Google!
ar: تم تسجيل الدخول عبر Google!
es: Iniciado sesión con Google
fr: Connecté avec Google
hi: Google के साथ साइन इन किया
pt: Entrou com Google

# authSignedInApple
source: Signed in with Apple!
ar: تم تسجيل الدخول عبر Apple!
es: Iniciado sesión con Apple
fr: Connecté avec Apple
hi: Apple के साथ साइन इन किया
pt: Entrou com Apple

# recipeUnlockFull
source: Unlock Full Recipe
es: Desbloquear Receta Completa
fr: Débloquer Recette
hi: पूरी रेसिपी अनलॉक करें
pt: Desbloquear Receita Completa

# chefAssistantTitle
source: AI Chef Assistant 👨‍🍳
es: Asistente Chef IA 👨‍🍳
fr: Assistant Chef IA 👨‍🍳
hi: AI शेफ असिस्टेंट 👨‍🍳
pt: Assistente Chef IA 👨‍🍳

# chefAssistantSubtitle
source: Ask about substitutions, techniques, or equipment alternatives.
es: Pregunta sobre sustituciones, técnicas o alternativas de equipo.
fr: Posez des questions sur les substitutions ou techniques.
hi: प्रतिस्थापन, तकनीक या उपकरण विकल्पों के बारे में पूछें।
pt: Pergunte sobre substituições, técnicas ou alternativas.

# chefAssistantHint
source: e.g. Can I use almond milk instead?
es: ej. ¿Puedo usar leche de almendras?
fr: ex: Puis-je utiliser du lait d'amande ?
hi: जैसे: क्या मैं बादाम के दूध का उपयोग कर सकता हूँ?
pt: ex: Posso usar leite de amêndoa?

# chefAssistantButton
source: Ask Chef
es: Preguntar al Chef
fr: Demander au Chef
hi: शेफ से पूछें
pt: Perguntar ao Chef

# chefThinking
source: Chef is thinking...
es: El Chef está pensando...
fr: Le Chef réfléchit...
hi: शेफ सोच रहा है...
pt: Chef pensando...

# chefNoAnswer
source: No answer provided.
es: Sin respuesta.
fr: Pas de réponse.
hi: कोई जवाब नहीं।
pt: Sem resposta.

# chefTimeout
source: The Chef is taking a little longer than usual. Please try again! (Timeout)
es: El Chef está tardando más de lo usual. ¡Intenta de nuevo!
fr: Le Chef prend plus de temps que prévu. Réessayez !
hi: शेफ सामान्य से अधिक समय ले रहा है। कृपया पुनः प्रयास करें!
pt: O Chef está demorando mais que o normal. Tente novamente!

source: Chef Says:
es: Chef Dice:
fr: Le Chef Dit :
hi: शेफ कहता है:
pt: Chef diz:

# chefSuggestedChange
source: Suggested Change
es: Cambio Sugerido
fr: Changement Suggéré
hi: सुझाया गया बदलाव
pt: Mudança Sugerida

# chefApplyChange
source: Apply Change
es: Aplicar Cambio
fr: Appliquer Changement
hi: बदलाव लागू करें
pt: Aplicar Mudança

# chefSwapInstruction
source: Swap {target} with {replacement}
es: Cambiar {target} por {replacement}
fr: Remplacer {target} par {replacement}
hi: {target} को {replacement} से बदलें
pt: Trocar {target} por {replacement}

# chefRemoveInstruction
source: Remove {target}
es: Eliminar {target}
fr: Retirer {target}
hi: {target} हटाएँ
pt: Remover {target}

# onboardingStepModeTitle
source: Choose Your Mode
es: Elige Tu Modo
fr: Choisissez Votre Mode
hi: अपना मोड चुनें
pt: Escolha Seu Modo

# onboardingStepModeDesc
source: Toggle between 'Discover' mode (type any craving) or 'My Pantry' mode (use what you have) to generate recipes.
es: Cambia entre el modo 'Descubrir' (escribe cualquier antojo) o el modo 'Mi Despensa' (usa lo que tienes) para generar recetas.
fr: Basculez entre le mode 'Découverte' (tapez une envie) ou 'Mon Garde-manger' (utilisez ce que vous avez).
hi: 'डिस्कवर' मोड (कुछ भी टाइप करें) और 'मेरी पैंट्री' मोड (जो आपके पास है उसका उपयोग करें) के बीच टॉगल करें।
pt: Alterne entre o modo 'Descobrir' (digite qualquer desejo) ou 'Minha Despensa' (use o que você tem).

# onboardingStepPromptTitle
source: Enter Your Craving
es: Introduce Tu Antojo
fr: Entrez Votre Envie
hi: अपनी लालसा दर्ज करें
pt: Digite Seu Desejo

# onboardingStepPromptDesc
source: Type what you're in the mood for, or describe the dish you want. Be as creative as you like!
es: Escribe lo que te apetece o describe el plato que quieres. ¡Sé tan creativo como quieras!
fr: Tapez ce que vous voulez manger ou décrivez le plat. Soyez créatif !
hi: आप जो खाना चाहते हैं उसे टाइप करें या पकवान का वर्णन करें। रचनात्मक बने!
pt: Digite o que quer comer ou descreva o prato. Seja criativo!

# onboardingStepGenerateTitle
source: Generate Your Recipe
es: Genera Tu Receta
fr: Générez Votre Recette
hi: अपनी रेसिपी जनरेट करें
pt: Gere Sua Receita

# onboardingStepGenerateDesc
source: Tap the Generate button and our AI chef will create a personalized recipe just for you.
es: Toca el botón Generar y nuestro chef IA creará una receta personalizada solo para ti.
fr: Appuyez sur Générer et notre chef IA créera une recette personnalisée pour vous.
hi: जनरेट पर टैप करें और हमारा एआई शेफ आपके लिए एक व्यक्तिगत रेसिपी बनाएगा।
pt: Toque em Gerar e nosso chef IA criará uma receita personalizada.

# onboardingStepDietaryTitle
source: Set Dietary Preferences
es: Establece Preferencias Dietéticas
fr: Préférences Diététiques
hi: आहार प्राथमिकताएँ सेट करें
pt: Preferências Dietéticas

# onboardingStepDietaryDesc
source: Enable dietary filters to automatically apply your saved preferences to every recipe.
es: Activa filtros dietéticos para aplicar automáticamente tus preferencias guardadas a cada receta.
fr: Activez les filtres pour appliquer automatiquement vos préférences à chaque recette.
hi: अपनी सहेजी गई प्राथमिकताओं को स्वचालित रूप से लागू करने के लिए फ़िल्टर सक्षम करें।
pt: Ative filtros para aplicar suas preferências automaticamente.

# onboardingStepPantryTitle
source: Switch to My Pantry
es: Cambia a Mi Despensa
fr: Passez à Mon Garde-manger
hi: मेरी पैंट्री पर जाएं
pt: Mude para Minha Despensa

# onboardingStepPantryDesc
source: Let's explore Pantry mode! Tap here to generate recipes using ingredients from your pantry.
es: ¡Exploremos el modo Despensa! Toca aquí para generar recetas usando ingredientes de tu despensa.
fr: Explorons le mode Garde-manger ! Touchez ici pour cuisiner avec vos ingrédients.
hi: आइए पैंट्री मोड का पता लगाएं! अपनी सामग्री के साथ पकाने के लिए यहां टैप करें।
pt: Vamos explorar o modo Despensa! Toque aqui para cozinhar com seus ingredientes.

# onboardingStepPantryFilterTitle
source: Refine with Filters
es: Refina con Filtros
fr: Affinez avec des Filtres
hi: फ़िल्टर के साथ निखारें
pt: Refine com Filtros

# onboardingStepPantryFilterDesc
source: Set cuisine, cooking time, skill level, and dietary labels to personalize your recipe suggestions.
es: Establece cocina, tiempo de cocción, nivel de habilidad y etiquetas dietéticas para personalizar tus sugerencias.
fr: Définissez cuisine, temps, niveau et étiquettes pour personnaliser les suggestions.
hi: सुझावों को निजीकृत करने के लिए व्यंजन, समय और कौशल सेट करें।
pt: Defina culinária, tempo, habilidade e etiquetas para personalizar.

# onboardingStepPantrySelectorTitle
source: Pick Meal Type & Vibe
es: Elige Tipo y Vibra
fr: Type de Repas & Ambiance
hi: भोजन का प्रकार और वाइब
pt: Tipo de Refeição & Vibe

# onboardingStepPantrySelectorDesc
source: Choose breakfast, main meal, dessert, or snack. Set a vibe like Comfort, Date Night, or Quick & Easy.
es: Elige desayuno, comida, postre o snack. Establece una vibra como Confort o Rápido.
fr: Petit-déjeuner, plat principal, dessert ou collation. Choisissez une ambiance comme Réconfort ou Rapide.
hi: नाश्ता, मुख्य भोजन, मिठाई या नाश्ता चुनें। आराम या त्वरित जैसा वाइब सेट करें।
pt: Café da manhã, almoço, sobremesa ou lanche. Escolha uma vibe como Conforto ou Rápido.

# onboardingStepPantryGenerateTitle
source: Generate from Pantry
es: Genera desde Despensa
fr: Générez depuis Garde-manger
hi: पैंट्री से जनरेट करें
pt: Gere da Despensa

# onboardingStepPantryGenerateDesc
source: Tap here to create recipes using what you already have! Our AI will match your ingredients to perfect dishes.
es: ¡Toca aquí para crear recetas usando lo que ya tienes! Nuestra IA combinará tus ingredientes para platos perfectos.
fr: Créez des recettes avec ce que vous avez déjà ! L'IA apparie vos ingrédients.
hi: जो आपके पास है उसका उपयोग करके रेसिपी बनाएं! एआई आपकी सामग्री का मिलान करता है।
pt: Crie receitas com o que já tem! A IA combina seus ingredientes.

# onboardingStepNavTitle
source: Explore the App
es: Explora la App
fr: Explorez l'App
hi: ऐप एक्सप्लोर करें
pt: Explore o App

# onboardingStepNavDesc
source: Use the bottom navigation to access Pantry, Recipes, Cart, and more. The Chef button brings you back here!
es: Usa la navegación inferior para acceder a Despensa, Recetas, Carrito y más.
fr: Utilisez la navigation pour accéder au Garde-manger, Recettes, Panier. Le bouton Chef vous ramène ici !
hi: पैंट्री, रेसिपी, कार्ट तक पहुंचने के लिए नेविगेशन का उपयोग करें।
pt: Use a navegação para acessar Despensa, Receitas, Carrinho. O botão Chef traz você de volta!

# onboardingSkip
source: Skip
es: Omitir
fr: Passer
hi: छोड़ें
pt: Pular

# onboardingNext
source: Next
es: Siguiente
fr: Suivant
hi: अगला
pt: Próximo

# onboardingDone
source: Done
es: Hecho
fr: Fait
hi: हो गया
pt: Feito

# onboardingDontShowAgain
source: Don't show again
es: No mostrar de nuevo
fr: Ne plus montrer
hi: फिर से न दिखाएं
pt: Não mostrar novamente

# settingsShowTutorial
source: Show Tutorial Again
es: Mostrar Tutorial de Nuevo
fr: Revoir le Tutoriel
hi: ट्यूटोरियल फिर से देखें
pt: Ver Tutorial Novamente

# guideSubscriptionPlans
source: Subscription Plans
es: Planes de Suscripción
fr: Plans d'Abonnement
hi: सदस्यता योजनाएं
pt: Planos de Assinatura

# guideSubscriptionPlansDesc
source: Understanding Your Tier
es: Entendiendo Tu Nivel
fr: Comprendre Votre Niveau
hi: अपना स्तर समझना
pt: Entendendo Seu Nível

# guideHomeCookTier
source: Home Cook (Free)
es: Cocinero Casero (Gratis)
fr: Cuisinier Amateur (Gratuit)
hi: होम कुक (निःशुल्क)
pt: Cozinheiro Caseiro (Grátis)

# guideHomeCookTierDesc
source: Generate up to 5 recipes per day. Limited vault storage. Perfect for casual cooks.
es: Genera hasta 5 recetas por día. Almacenamiento limitado en bóveda. Perfecto para cocineros ocasionales.
fr: Jusqu'à 5 recettes/jour. Stockage limité. Parfait pour les occasionnels.
hi: प्रति दिन 5 रेसिपी तक। सीमित भंडारण।
pt: Até 5 receitas/dia. Armazenamento limitado. Perfeito para ocasionais.

# guideSousChefTier
source: Sous Chef
hi: सूस शेफ

# guideSousChefTierDesc
source: Unlimited recipes, unlimited vault, dietary profiles, and enhanced generation.
es: Recetas ilimitadas, bóveda ilimitada, perfiles dietéticos y generación mejorada.
fr: Recettes illimitées, coffre illimité, profils diététiques et génération améliorée.
hi: असीमित रेसिपी, असीमित वॉल्ट और उन्नत जनरेशन।
pt: Receitas ilimitadas, cofre ilimitado, perfis dietéticos e geração melhorada.

# guideMealPlanning
source: Meal Planning
es: Planificación de Comidas
fr: Planification de Repas
hi: भोजन योजना
pt: Planejamento de Refeições

# guideMealPlanningDesc
source: Plan your week with ease.
es: Planifica tu semana fácilmente.
fr: Planifiez votre semaine facilement.
hi: आसानी से अपने सप्ताह की योजना बनाएं।
pt: Planeje sua semana com facilidade.

# guideAddToPlan
source: Add to Plan
es: Añadir a Plan
fr: Ajouter au Plan
hi: योजना में जोड़ें
pt: Adicionar ao Plano

# guideAddToPlanDesc
source: Tap the calendar icon on any recipe to schedule it for breakfast, lunch, or dinner.
es: Toca el calendario en cualquier receta para programarla.
fr: Touchez le calendrier sur n'importe quelle recette pour planifier.
hi: शेड्यूल करने के लिए कैलेंडर पर टैप करें।
pt: Toque no calendário em qualquer receita para agendar.

# guideCalendarView
source: Calendar View
es: Vista Calendario
fr: Vue Calendrier
hi: कैलेंडर दृश्य
pt: Visualização de Calendário

# guideCalendarViewDesc
source: See your upcoming meals at a glance and track nutrition for the day.
es: Ve tus próximas comidas y rastrea la nutrición diaria.
fr: Voyez vos repas à venir et suivez la nutrition.
hi: आगामी भोजन और पोषण देखें।
pt: Veja suas próximas refeições e acompanhe a nutrição.

# guideShoppingListSync
source: Smart Sync
es: Sincronización Inteligente
fr: Synchro Intelligente
hi: स्मार्ट सिंक
pt: Sincronização Inteligente

# guideShoppingListSyncDesc
source: Ingredients from planned meals are automatically added to your shopping list.
es: Los ingredientes planificados se añaden a tu lista de compras.
fr: Les ingrédients planifiés s'ajoutent à votre liste.
hi: नियोजित सामग्री आपकी सूची में जुड़ जाती है।
pt: Os ingredientes planejados são adicionados à sua lista de compras.

# guideDiscoverTitle
source: Discover & Create
es: Descubre y Crea
fr: Découvrir & Créer
hi: खोजें और बनाएं
pt: Descubra & Crie

# guideDiscoverDesc
source: Craft recipes from scratch or using your pantry.
es: Crea recetas desde cero o usando tu despensa.
fr: Créez des recettes de zéro ou avec votre garde-manger.
hi: शुरुआत से या अपनी पैंट्री का उपयोग करके रेसिपी बनाएं।
pt: Crie receitas do zero ou usando sua despensa.

# guidePromptStep
source: Enter Prompt
es: Introduce Prompt
fr: Entrez Prompt
hi: प्रॉम्प्ट दर्ज करें
pt: Insira Prompt

# guidePromptDesc
source: Type a craving or use a 'Recent Chip' to save time.
es: Escribe un antojo o usa un 'Chip Reciente' para ahorrar tiempo.
fr: Tapez une envie ou utilisez une idée récente.
hi: इच्छा टाइप करें या हाल के विचार का उपयोग करें।
pt: Digite um desejo ou use uma ideia recente.

# guideFiltersStep
source: Chef Filters
es: Filtros de Chef
fr: Filtres Chef
hi: शेफ फ़िल्टर
pt: Filtros Chef

# guideFiltersDesc
source: Customize with Diet, Vibe, and more.
es: Personaliza con Dieta, Vibra y más.
fr: Personnalisez avec Diète, Ambiance, etc.
hi: आहार, वाइब और बहुत कुछ के साथ अनुकूलित करें।
pt: Personalize com Dieta, Vibe e mais.

# guideSwitchModeStep
source: Switch Mode
es: Cambiar Modo
fr: Changer de Mode
hi: मोड बदलें
pt: Mudar Modo

# guideSwitchModeDesc
source: Toggle to 'My Pantry' to use your inventory.
es: Cambia a 'Mi Despensa' para usar tu inventario.
fr: Passez à 'Mon Garde-manger' pour utiliser votre stock.
hi: अपने स्टॉक का उपयोग करने के लिए 'मेरी पैंट्री' पर जाएं।
pt: Mude para 'Minha Despensa' para usar seu estoque.

# guidePantryLogicStep
source: Pantry Logic
es: Lógica de Despensa
fr: Logique Garde-manger
hi: पैंट्री लॉजिक
pt: Lógica da Despensa

# guidePantryLogicDesc
source: Filter ingredients and select meal types.
es: Filtra ingredientes y selecciona tipos de comida.
fr: Filtrez ingrédients et types de repas.
hi: सामग्री फ़िल्टर करें और भोजन के प्रकार चुनें।
pt: Filtre ingredientes e selecione tipos de refeição.

# guideUnifiedGenerate
source: Generate Magic
es: Generar Magia
fr: Générer Magia
hi: जादू जनरेट करें
pt: Gerar Magia

# guideUnifiedGenerateDesc
source: Tap the Magic Wand to craft your meal.
es: Toca la Varita Mágica para crear tu comida.
fr: Appuyez sur la Baguette Magique pour créer.
hi: अपना भोजन बनाने के लिए जादुई छड़ी पर टैप करें।
pt: Toque na Varinha Mágica para criar.

# guideStockUpStep
source: Stock Up
es: Abastecer
fr: Remplir
hi: स्टॉक अप
pt: Abastecer

# guideStockUpDesc
source: Add items manually or use the Scanner.
es: Añade artículos manualmente o usa el Escáner.
fr: Ajoutez manuellement ou utilisez le Scanner.
hi: मैन्युअल रूप से आइटम जोड़ें या स्कैनर का उपयोग करें।
pt: Adicione manualmente ou use o Scanner.

# guideSmartMgmtStep
source: Smart Management
es: Gestión Inteligente
fr: Gestion Intelligente
hi: स्मार्ट प्रबंधन
pt: Gestão Inteligente

# guideSmartMgmtDesc
source: Track freshness and quantities.
es: Rastrea frescura y cantidades.
fr: Suivez fraîcheur et quantités.
hi: ताजगी और मात्रा को ट्रैक करें।
pt: Acompanhe frescor e quantidades.

# guideShopListStep
source: Shopping List
es: Lista de Compras
fr: Liste de Courses
hi: खरीदारी सूची
pt: Lista de Compras

# guideShopListDesc
source: Auto-syncs with your meal plans.
es: Se sincroniza automáticamente con tus planes de comida.
fr: Synchro auto avec vos plans repas.
hi: आपकी भोजन योजनाओं के साथ ऑटो-सिंक।
pt: Sincroniza automaticamente com seus planos.

# guidePantrySwitch
source: Switch Mode
es: Cambiar Modo
fr: Changer Mode
hi: मोड बदलें
pt: Mudar Modo

# guidePantrySwitchDesc
source: Tap 'My Pantry' to toggle the generator mode.
es: Toca 'Mi Despensa' para cambiar el modo del generador.
fr: Touchez 'Mon Garde-manger' pour changer le mode.
hi: मोड बदलने के लिए 'मेरी पैंट्री' पर टैप करें।
pt: Toque em 'Minha Despensa' para mudar o modo.

# guidePantryRefine
source: Refine Results
es: Refinar Resultados
fr: Affiner Résultats
hi: परिणाम निखारें
pt: Refinar Resultados
